{ "Contents" : [ { "Contents" : { "Contents" : [ { "Contents" : { "Items" : [ [ "Cultural Algorithms: Tools for the Engineering of Social Intelligence into Complex Systems. To appear 2018, Wiley-IEEE Press.", "This text is designed to introduce Engineers to the use of socially motivated evolutionary algorithms to the design of complex Engineering environments." ], [ "Cultural Algorithms: Putting Social Networks to Work , Robert G. Reynolds, Springer-Verlag, to appear, 2018.", "This book focuses on the design of Cultural Algorithm solutions to real world optimization problems. In particular, it focuses on the role that social networks play in the distribution of problem solving knowledge." ], [ "An Adaptive Computer Model of the Evolution of Agriculture in the Valley of Oaxaca, Mexico, Ph.D. Thesis, University of Michigan, 1979, University Microfilms", "This thesis used a specific machine learning technique, genetic algorithms, to model the decision-making adaptations made by prehistoric hunter-gatherers during the process of developing incipient agriculture. The genetic algorithm selectively operated on decision-making procedures expressed as production rules in a knowledge base in order to adapt to the simulated environment in which the system was embedded. The results were compared with the archaeological data from the region and proved sufficient to explain a number of patterns in that data." ] ] }, "Title" : "Authored" }, { "Contents" : { "Items" : [ [ "Prehistory and Human Ecology of the Valley of Oaxaca:Excavations at San Jose Magote I: The Household Archaeology, Kent V. Flannery, Joyce Marcus, and Robert G. Reynolds, Memoirs of the Museum of Anthropology, University of Michigan, Number 40, 2005.", "" ], [ "The Automatic Acquisition of Software Engineering Knowledge: Evolution-Based Approaches to Knowledge Acquisition in Automatic Programming Systems with George Cowan World Scientific Press, 2003.", "This text focuses on the acquisition of knowledge about software engineering activities within a Genetic Programming Environment Using Cultural Algorithms. The book describes an automated programming environment based around Genetic Programming GP that supports the development of large-scale software systems. An example subsystem describing the learning of metrics to describe the quality of software produced by a GP agent is presented." ], [ "The Flocks of the Wamani , First Edition, Academic Press, 1989 with Kent V. Flannery and Joyce Marcus. Second Edition, Left Coast Press, 2010.", "This text focuses on the development of both computer simulations and analytical models that describe how cooperative mechanisms can be learned and spread within a distributed problem solving system. The specific example used here are the gift giving ceremonies of Peruvian Llama herders." ] ] }, "Title" : "Co-Authored" } ] }, "Title" : "Scholarly Books Published" }, { "Contents" : { "Contents" : [ { "Contents" : { "Items" : [ [ "Reynolds, R. G., \" Chapter 1: A General Statistical Analysis of Occupational Remains in Cueva Blanca\", in Cueva Blanca: The Site Report , Kent V. Flannery, Editor, Memoirs of the Museum of Anthropology at the University of Michigan, to appear." ], [ "Reynolds, R. G., \" Chapter 2: Identifying Spatially Associated Groups of Artifacts Using Cluster Analysis\", in Cueva Blanca: The Site Report , Kent V. Flannery, Editor, Memoirs of the Museum of Anthropology at the University of Michigan, to appear." ], [ "Reynolds, R. G., \" Chapter 3: Extracting Drop Area Aggregates Using Techniques from Artificial Intelligence\", in Cueva Blanca: The Site Report , Kent V. Flannery, Editor, Memoirs of the Museum of Anthropology at the University of Michigan, to appear." ], [ "Reynolds, R. G., \" Chapter 4: Using the Extracted Drop Area Aggregates to Identify Regions of Activity in Zone E\", in Cueva Blanca: The Site Report , Kent V. Flannery, Editor, Memoirs of the Museum of Anthropology at the University of Michigan, to appear." ], [ "Reynolds, R. G., \" Chapter 5: Using the Extracted Drop Area Aggregates to Identify Regions of Activity in Zone D\", in Cueva Blanca: The Site Report , Kent V. Flannery, Editor, Memoirs of the Museum of Anthropology at the University of Michigan, to appear." ], [ "Reynolds, R. G., \" Chapter 6: Using the Extracted Drop Area Aggregates to Identify Regions of Activity in Zone C\", in Cueva Blanca: The Site Report , Kent V. Flannery, Editor, Memoirs of the Museum of Anthropology at the University of Michigan, to appear." ], [ "Reynolds, R.G., Chapter 25: Multi-Dimensional Scaling of San Jose Magote Data, in San Jose Magote:The Site Report , Kent V. Flannery and Joyce Marcus, Editors, Memoirs of the Museum of Anthropology at the University of Michigan, 2005, pp: 446-455." ], [ "Reynolds, R.G., Software Design Metrics, Encyclopedia of Software Engineering: Second Edition, Ed. J. Marciniak, John Wiley and Sons Press, 2002." ], [ "Reynolds, R.G., The Impact of Raiding on Settlement Patterns in the Northern Valley of Oaxaca: An Approach Using Decision Trees, Dynamics in Human and Primate Societies: Agent-Based Modelling of Social and Spatial Processes , T. Kohler and G. Gummerman, Editors, Oxford University Press, 1999, pp: 251-274." ], [ "Reynolds, R.G., An Overview of Cultural Algorithms, New Ideas in Optimization , D. Corne, F. Glover, and M. Dorigo Ed., McGraw Hill Press, 1999, pp: 367-378." ], [ "Reynolds, R. G., \"Why Does Cultural Evolution Proceed at a Faster Rate Than Biological Evolution\", in Time, Process, and Structured Transformation in Archaeology , Sander van der Leeuw and James McGlade Editors, Routledge Press, New York, NY, 1997, pp. 269-282." ], [ "Reynolds, R. G., \"Introduction to Cultural Algorithms\", in Proceedings of the Third Annual Conference on Evolutionary Programming , Anthony V. Sebald and Lawrence J. Fogel, Editors, World Scientific Press, Singapore, 1994, pp.131-139." ], [ "Reynolds, R. G., \"Learning to Cooperate Using Cultural Algorithms\", in Simulating Societies, Nigel Gilbert and J. Doran, Editors, University College of London Press, 1994, pp. 223-244." ], [ "Reynolds, R. G., \"The Design of an Adaptive Expert Database Interface\", in Relational Database Machine Architecture , A. K. Sood and A. H. Qureshi, Editors, Spring-Verlag Press, 1986." ], [ "Reynolds, R. G., \"An Adaptive Computer Model for the Evolution of Plant Collecting and Early Agriculture in the Eastern Valley of Oaxaca\", in Guila Naquitz: Archaic Foraging and Early Agriculture in Oaxaca, Mexico , K. V. Flannery, Editor, Academic Press, 1986. pp. 439-500." ], [ "Reynolds, R. G., \"Multidimensional Scaling of Four Guila Naquitz Living Floors\", in G uila Naquitz: Archaic Foraging and Early Agriculture in Oaxaca, Mexico , K. V. Flannery, Editor, Academic Press, 1986. pp: 385-424." ], [ "Reynolds, R. G., \"PARTIAL: A Software Tool for the Development of ADA Programs\", in Empirical Foundations of Information and Software Science , J. Agrawal and P. Zunde, Editors, 1985. pp. 241-264." ], [ "Reynolds, R. G., \"The Application of a Double Dependence Markov Model to the Analysis of Settlement Patterns Along the Rio Grijalva\", in The Early Mesoamerican Village , K. V. Flannery, Editor, Academic Press, 1976. pp. 180-191." ] ] }, "Title" : "Authored" }, { "Contents" : { "Items" : [ [ "Kattan, K., Reynolds, R.G., Marcus, J., Artisanal Fishing at Cerro Azul, 1984-1986, Ed. Joyce Marcus, in Coastal Ecosystems and Economic Strategies at Cerro Azul, Peru: The Study of a Late Intermediate Kingdom , Memoirs of the Museum of Anthropology, University of Michigan, Ann Arbor, Number, 59, pp: 352-358, 2016." ], [ "Liu, D. , Salaymeh, A. and Reynolds, R.G, Multi-Objective Cultural Algorithms, Artificial Intelligence and Complex Systems , Springer-Verlag, American Association of Artificial Intelligence, 2015." ], [ "Fogarty, J., Reynolds, R.G., and Salamayeh, A., and Palazollo, T., Serious Game Modeling of Caribou Behavior Across Lake Huron using Cultural Algorithms and Influence Maps, Ed. John OShea and E. Sonnenberg, Archaeological, Ethnographic and Paleo-Environmental Perspectives on Caribou Hunting in the Great Lakes: Maps, Directions and Accommodations , University of Michigan Museum of Anthropology, 2015." ], [ "Joyce Marcus, Kent V. Flannery, J. Sommer, and Robert G. Reynolds. Maritime Adaptations at Cerro Azul, Peru: A Comparison of Late Intermediate and 20 th Century Fishing. In Andean Maritime Communities , edited by Gabriel Prieto and Dan Sandweiss, University Press of Florida , 2015." ], [ "Jayyousi, T., Reynolds, R.G., Exploiting the Synergy between the Micro, Meso, and Macro Levels in a Complex System: Bringing to Life an Ancient Urban Center. In Human Complexity: Studies in Complex Social Systems , Paul Youngman ed., Stanford Press, Singapore, 2013." ], [ "Reynolds, R. G., OShea, J., Che Z., Gawasmeh, Y., Meadows, G. , and Fotouhi, F., The Agile Design of Reality Game AI, in Multi-Agent Applications with Evolutionary Computation and Biologically Inspired Technologies: Intelligent Techniques for Ubiquity and Optimization , IGI Global Press, 2011." ], [ "Reynolds, R.G.,Whallon, R., Ali, M. Z., Zadegan, B. M., Agent-Based Modeling of Early Cultural Evolution in Simulating Change: Archaeology into the 21 st Century, Eds. Andre Costopolous and Mark Lake, University of Utah Press, Salt Lake City Utah, 2011." ], [ "Reynolds, R. G., Ali, M., and Franzel, P., Using Genetic Programming and Cultural Algorithms to Simulate the Evolution of an Ancient Urban Center, Genetic Programming: Theory and Practice Vol. V, Ed. Terence Soule, Rick Riolo, and Bill Worzel, 2008, pp: 261-276." ], [ "Kohler, T., Johnson, D., Kolm, K., and Varien, M., Ortman, S., Reynolds, R.G., Kobti, Z., Settlement Ecodynamics in the Prehispanic Mesa Verde, Modeling Socioecological Systems , edited by Sander van der Leeuw and Tim Kohler, SAR Press, 2007." ], [ "Reynolds, R.G., Sverdlik, W. and Kala, E. , The Power of Abstraction: Achieving Resilience in the Solution of Hierarchically Structured Problems Using Representation Shifts, Abisko Workshop on System Resilience , Ed. Van Der Leeuw, S., Kohler, T., and Read, D, Kluwer Academic Press, 2007." ], [ "Lazar, A., and Reynolds, R.G., Evolution-Based Learning of Ontological Knowledge for a Large-Scale Multi-Agent Simulation , Information Processing and Evolutionary Algorithms-From Industrial Applications to Academic Speculation, M. Grana, R.J. Duro, A.D. Aryou, and P.P Wang, eds, Berlin, Springer-Verlag, 2005." ], [ "Reynolds, R.G., and Saleem, S., The Impact of Environmental Dynamics on Cultural Emergence, Perspectives on Adaptation in Natural and Artificial Systems: Essays in Honor of John Holland , L. Booker, S. Forrest, M. Mitchell, and R. Riolo, Eds., Oxford University Press, pp. 253-280, 2005." ], [ "Ostrowski, D, and Reynolds, R. G., Using Software Engineering Knowledge to Drive Genetic Program Design Using Cultural Algorithms: Exploiting the Synergy of Software Engineering Knowledge in Evolutionary Design, in Advances in Genetic Programming , Editors: Rick Riolo and Bill Wurzel, Kluwer Academic Press, Boston, MA., 2003, pp: 63-80." ], [ "Lazar, A., and Reynolds, R. G., Heuristic Knowledge Discovery for Archaeological Data Using Cultural Algorithms and Rough Sets, Heuristics and Optimization for Knowledge Discovery, R. Sarkar, H. Abbass, and C. Newton, Editors , Kluwer Academic Press, 2003." ], [ "Reynolds, R.G., and Chung, C., \"Function Optimization using Evolutionary Programming with Self-Adaptive Cultural Algorithms\", in Lecture Notes on Artificial Intelligence , Springer-Verlag Press, 1997, pp. 184-198." ], [ "Reynolds, R.G., and Chung, C., \"A Cultural Algorithm to Evolve Multi- Agent Cooperation Using Cultural Algorithms\", in Evolutionary Programming VI , P. J. Angeline, R. G. Reynolds, J. R. McDonnell, and R. Eberhart, Editors, Springer-Verlag Press, New York, NY, 1997, pp. 323-334." ], [ "Reynolds, R.G., and Nazzal, A. \"Using Cultural Algorithms with Evolutionary Computing to Extract Site location Decisions From Spatio-Temporal Databases, in Evolutionary Programming VI , P. J. Angeline, R. G. Reynolds, J. R. McDonnell, and R. Eberhart, Editors, Springer-Verlag Press, New York, NY, 1997, pp. 323-334." ], [ "Reynolds, R. G., and Chung, C., \"A Test Bed for Solving Optimization Problems Using Cultural Algorithms\", in Evolutionary Programming V , John R. McDonnel, and Peter Angeline, Editors, A Bradford Book, MIT Press, Cambridge Massachusetts, 1996, pp. 225-236." ], [ "Zannoni, E., and Reynolds, R. G., \"Extracting Design Knowledge from Genetic Programs Using Cultural Algorithms\", in Evolutionary Programming V , Peter Angeline, Editor, A Bradford Book, MIT Press, Cambridge Massachusetts, 1996, pp. 217-224." ], [ "Reynolds, R.G., Michalewicz Z., and Cavaretta M. J., \"Using Cultural Algorithms for Constraint Handling in Genocop\", in Evolutionary Programming IV ," ], [ "J. R. McDonnell, R.G. Reynolds, and David B. Fogel, Editors, a Bradford Book, MIT Press, Cambridge, Massachusetts, 1995." ], [ "Reynolds, R. G., and Zannoni, E., \"Software Metrics\", in Encyclopedia of Microcomputers , A. Kent and J. G. Williams, Editors, Marcel Dekker Inc., New York, 1995, Vol. 16, pp. 111-126." ], [ "Reynolds, R. G., and Zannoni, E., \"Software Metrics\", in Encyclopedia of Software Engineering , J. J. Marciniak, Editor, McGraw-Hill, 1994, pp. 676- 685 ." ], [ "Reynolds, R.G., and Maletic J. I., \"The Evolution of Cooperate using Cultural Algorithms\", in Proceedings of the Third Annual Conference on Evolutionary Programming , Anthony V. Sebald and Lawrence J. Fogel, Editors, World Scientific Press, Singapore, 1994, pp.141-149." ], [ "Reynolds R. G., Zannoni, E., and Posner, R. M., \"Learning to Understand Software using Cultural Algorithms\", in Proceedings of the Third Annual Conference on Evolutionary Programming , Anthony V. Sebald and Lawrence J. Fogel, Editors, World Scientific Press, Singapore, 1994, pp.150-157." ], [ "Reynolds, R. G. , Brown, W., and Abinoja, E., \"Guiding Parallel Bidirectional Search with Cultural Algorithms, in Proceedings of the Third Annual Conference on Evolutionary Programming , Anthony V. Sebald and Lawrence J. Fogel, Editors, World Scientific Press, Singapore, 1994, pp.167-174." ], [ "Reynolds, R. G., et. al. \"Modeling the Evolution of Southwestern Cultural Systems\", in The Origin and Evolution of Prehistoric Southwestern Society , School of American Research, 1992." ], [ "Reynolds, R. G., and Maletic, J., \"Operationalizing Software Reuse as a Problem in Machine Learning\", in Automating Software Design , G. Johnson, Editor, USCISI Technical Publications, RS-91-237, 1991." ], [ "Reynolds, R. G. and Zeigler, B., \"Modeling Alternative Structures for Time Critical Corporate Adaptations\", in Real-Time Control of Large Scale Systems , Tsafestas, Editor, Lecture Notes on Information and Control, Springer-Verlag, 1984." ], [ "Reynolds, R. G. and Zeigler, B.,\"Information Processing Models for Hunter- Gatherer Decision Making\", in Mathematical Models of Cultural Change , Colin Renfrew and Kenneth Cooke, Editors, Academic Press, December 1978. pp. 485-418." ] ] }, "Title" : "Co-Authored" } ] }, "Title" : "Chapters Published" }, { "Contents" : { "Items" : [ [ "Reynolds, R.G., Co-Editor, IEEE Proceedings of the 2003 Congress on Evolutionary Computation , with Rahul Tikar, and Bob McKay, 2003." ], [ "Reynolds, R.G., Co-editor, Tools for Artificial Intelligence 1997 Proceedings , with Phillip Sheu, IEEE Press." ], [ "Reynolds, R.G., Co-Editor, Evolution Programming VI , with Peter Angeline, Russ Eberhart, and John McDonnell, Springer-Verlag Press, 1997." ], [ "Reynolds, R.G., Co-Editor, Evolution Programming IV , with John R. McDonnell, and David B. Fogel, Bradford Books, MIT Press, Cambridge Massachusetts, 1995." ], [ "Reynolds, R. G., Guest Editor, \"Special Issue on the Use of Evolution-Based Approaches in Software Engineering\", International Journal of Software Engineering and Knowledge Engineering , June, 1995." ], [ "Reynolds, R. G., Guest Editor of, \"The Evolution of Commercial AI Tools: The First Decade\", invited paper by Frederick Hayes-Roth, International Journal on Artificial Intelligence Tools , Vol. 2, No. 1, pp. 1-13,1993." ], [ "Reynolds, R. G, Guest Editor, Special issue on the Acquisition of Software Engineering Knowledge, in International Journal of Software Engineering and Knowledge Engineering , Vol. 1, No. 4, December, 1991." ] ] }, "Title" : "Book Editorships" }, { "Contents" : { "Contents" : [ { "Contents" : { "Items" : [ [ "Awad, N. H., Ali, M. Z., Suganthan, P. N., and Reynolds, R. G., CADE: A hybridization of Cultural Algorithm and Differential Evolution for numerical optimization, Information Sciences , Vol. 378, pp: 215-241, 2017." ], [ "Ali, M. Z., Awad, N. H., Suganthan, P. N., and Reynolds, R. G. , An Adaptive Multipopulation Differential Evolution With Dynamic Population Reduction, IEEE Transactions on Cybernetics , 2016." ], [ "Ali, M. Z., Awad, N. H., Suganthan, P. N.,and Reynolds, R. G. 2016. A Modified Cultural Algorithm With a Balanced Performance for the Differential Evolution Frameworks. Knowledge-Based Systems , Vol. 111, pp: 73-86, 2016." ], [ "Ali, M. Z., Suganthan, P. N., Reynolds, R. G., and Al-Badarneh, A. F., Leveraged Neighborhood Restructuring in Cultural Algorithms for Solving Real-World Numerical Optimization Problems, IEEE Transactions on Evolutionary Computation , 202, 218-231, 2016." ], [ "Ali, M. Z., Awad, N. H., Suganthan, P. N., Duwairi, R. M., and Reynolds, R. G., A Novel Hybrid Cultural Algorithms Framework With Trajectory-Based Search for Global Numerical Optimization, Information Sciences , Vol. 334, 219-249, 2016." ], [ "Ebrahimi, M., Mohan, A., Kashlev A., Lu, S., and Reynolds, R.G., Task and Data Allocation Strategies for Big Data Workflows, International Journal on Big Data IJBD , Volume 2, Number 2, pp. 28-42, 2015." ], [ "Acharya, L. R., Reynolds, R.G., and Zhu, D., Network Inference Through Synergistic Subnetwork Evolution , to appear in EURASIP Journal on Bioinformatics and Systems Biology, 2015." ], [ "Reynolds R. G., OShea J., Salaymeh A., and Lemke A., \"Using Agent-Based Modeling and Cultural Algorithms to Predict the Location of Submerged Ancient Occupation Sites \". AI Matters: ACM SIGAI Newsletter , August, 2014." ], [ "Jayyousi, T., Reynolds, R.G., \"Extracting Urban Occupational Plans Using Cultural Algorithms\", IEEE Computational Intelligence Magazine , Vol. 9, No. 3, August 2014, pp: 66-87." ], [ "OShea, J, Lemke, A., Sonnenburg, E., Reynolds, R.G., and Abbot, B., A 9,000 Year-Old Submerged Caribou Hunting Structure in Lake Huron, Proceedings of the National Academy of Science , April 29, 2014." ], [ "Che X., Salaymeh A., and Reynolds R.G., Monitoring the Vital Signs in a Complex Social System: An Example using Cultural Algorithms, International Journal of Swarm Intelligence Research , January March, 2014, Vol. 5, No. 1, pp: 57-109." ], [ "Reynolds, R.G, Vitale, K., Che, X., OShea, J. and Salaymeh,A. Using Virtual Worlds to Facilitate the Exploration Of Ancient Landscapes International Journal of Swarm Intelligence Research IJSIR, Volume 4, No. 2, pp: 49-83, 2013." ], [ "Reynolds, R.G., Kinniard-Heether, Optimization Problem Solving with Auctions in Cultural Algorithms, in International Journal of Memetics , 2013." ], [ "Kohler, T., Gummerman, G., and Reynolds, R.G., Exodus on Computers, in Spektrum German Scientific American, Jan. 2013, pp: 88-93." ], [ "OShea, J., Lemke, A., and Reynolds, R.G., Nobody Knows the Ways of the Caribou, in Quaternary International, January 12, 2013, Elsevier Press." ], [ "Ali , M., Salhieh , A. , and Snanieh , Randa T. Abu., and R eynolds, R.G., Boosting Cultural Algorithms with a Heterogeneous Layered Social Fabric Influence Function , in Journal of Computational and Mathematical Organization Theory , Kluwer Academic Publishers , 2012 ." ], [ "Vitale, K., Reynolds, R. G., OShea, J., and Meadows, G., Exploring Ancient Landscapes Under Lake Huron Using Cultural Algorithms, in Procedia Computer Sciences , Elsevier Press, Volume 6, pp: 303-310, 2011." ], [ "Reynolds, R.G., Che, X., and Ali, M., Weaving the Social Fabric: The Past, Present and Future of Optimization Problem Solving with Culture Algorithms, International Journal of Complexity and Cybernetics , 2011." ], [ "Snaineh R., Younes A., Ali, M., Salhieh A., and Reynolds, R. G., I-Architect A Virtual Reality CAD System, IEEE Multi-Disciplinary Engineering Education Magazine , Vol. 6, No. 4, pp:14-21, 2011 ." ], [ "Reynolds, R.G., Che, Sean, and Ali, M., Weaving the Social Fabric: Problem Solving with Cultural Algorithms, International Journal of Complexity and Cybernetics , Vol. 3, No. 4, pp: 561-592, 2010." ], [ "Reynolds, R.G., Kinnaird-Heether, L., Networks Do Matter: The Socially Motivated Design of a 3D Racing Controller Using Cultural Algorithms, International Journal of Swarm Intelligence Research, January, 2010 ." ], [ "Whallon, R., Reynolds R.G., Scheer, H. E., Simulation of the Effects of Environmental Richness on the Success of Different Modes of Sharing in Pre- and Proto-Cultural Foraging Groups, Journal of the Israel Prehistory Society , Vol. 40, pp: 1-21, 2010." ], [ "Reynolds, R. G., A Geneology of Computational Intelligence Books, IEEE Computational Intelligence Magazine , Vol. 4, No. 1, January, 2009." ], [ "Reynolds, R.G., and Ali, M., Embedding a Social Fabric Component into a Cultural Algorithms Toolkit for an Enhanced Knowledge-Driven Engineering Optimization, International Journal of Intelligent Computing and Cybernetics , Vol. 1,No. 4, 2008, pp: 563-597." ], [ "Reynolds, R.G., and Ali, M., Computing with the Social Fabric: The Evolution of Social Intelligence within a Cultural Framework, IEEE Computational Intelligence Magazine , Vol. 3, No. 1, pp: 18-30, February 2008." ], [ "Reynolds, R.G., Ali, M., and Jayyousi, T., Mining the Social Fabric of Archaic Urban Centers with Cultural Algorithms, IEEE Computer , Vol. 41, No. 1, pp: 64-72, January 2008." ], [ "Reynolds, R.G., Peng B., Ali, M ., The Role of Culture in the Emergence of Decision-Making Roles: An Example Using Cultural Algorithms , Complexity , Volume 13, Issue 3, pp: 27 42." ], [ "Ziad Kobti, Robert G. Reynolds , Timothy A. Kohler : The Emergence of Social Network Hierarchy Using Cultural Algorithms. International Journal on Artificial Intelligence Tools 15 6: 963-978 2006." ], [ "Reynolds, R.G., Kobti, Z., Kohler, T., and Yap, L., Unraveling Ancient Mysteries: Re-imagining the Past Using Evolutionary Computation in a Computer Gaming Environment, IEEE Transactions on Evolutionary Computation , Vol. 9, No. 6, pp: 708-720, December, 2005." ], [ "Kohler, T., Gummerman, G., and Reynolds, R. G., Virtual Archaeology, Scientific American , vol. 293, no. 1, pp: 76-84, July, 2005." ], [ "Kent V. Flannery, Andrew K. Balkansky, Gary M. Feinman, David C. Grove, Joyce Marcus, Elsa M. Redmond, Robert G. Reynolds, Robert J. Sharer, Charles S. Spencer, and Jason Yaeger, Implications of New Petrographic Analysis for the Olmec Mother Culture Model, in Proceedings of the National Academy of Sciences, vol. 102, no. 32, pp:11219-11223, August 8, 2005." ], [ "Rychtyckyj, N. and Reynolds, R.G., Using Cultural Algorithms to Re-Engineer Large-Scale Semantic Networks, International Journal of Software Engineering and Knowledge Engineering , 2005." ], [ "Reynolds, R. G., and Peng, B., Knowledge Learning and Social Swarms in Cultural Algorithms, Journal of Mathematical Sociology , London, Routledge, Vol. 29: pp. 1-18, 2005." ], [ "Fotouhi, F., Lu, S., Liu, D., Dong, M., Aristar, A., Ratliff, M., Nathan, G.,Tan, J., Reynolds, R. G., and Powell, R., \"Language Engineering For The Semantic Web: A Digital Library For Endangered Languages\", International Journal of Information Research , 2005, Vol. 9, No. 3, 2004." ], [ "Reynolds, R.G., and Kobti, Z., and Kohler, T., The Effects of Generalized Reciprocal Exchange on the Resilience of Social Networks: An Example From the Prehistoric Mesa Verde Region, Journal of Computational and Mathematical Organization Theory , Kluwer Academic Publishers, 2004, pp: 229-254." ], [ "Jin, X. and Reynolds, R. G., Regional Schemata for Real-Valued Constrained Function Optimization Using Cultural Algorithms, Journal of Natural Computing , T. Back, Editor, 2002." ], [ "Reynolds, R.G., Goodhall, S.,and Whallon, R., Transmission of Cultural Traits by Emulation: An Agent Based Model of Group Foraging Behavior, Journal of Memetics , Vol. 4, Issue 2, March, 2001." ], [ "Reynolds, R.G., Fogel, D., and Rizki, M., Memorial Tribute to Michael Conrad, IEEE Transactions on Evolutionary Computation , Vol. 5, No. 1, February, 2001, pp. 1-2." ], [ "Reynolds, R. G., and Zhu, Shinin, Fuzzy Cultural Algorithms with Evolutionary Programming for Real-Valued Function Optimization, IEEE Transactions on Systems, Man, and Cybernetics , Part B: Cybernetics, Vol. 31, No. 1, February, 2001, pp. 1-18." ], [ "Jin, X., and Reynolds, R. G., Using Knowledge-Based Systems with Hierarchical Architectures to Guide Evolutionary Search, International Journal of Artificial Intelligence Tools , Vol. 9, No. 1, 2002, pp: 27-44." ], [ "Chung, Chan-Jin, and Reynolds, R. G., Knowledge-Based Self-Adaptation in Evolutionary Search, International Journal of Pattern Recognition and Artificial Intelligence , Vol. 14, No. 1, 2000." ], [ "Chung, Chan-Jin, and Reynolds, R. G., \"CAEP: An Evolution-Based Tool for real-Valued Function Optimization Using Cultural Algorithms\", International Journal on Artificial Intelligence Tools , Vol. 7, No. 3, September, 1998, pp. 239-293." ], [ "Sternberg, Michael and Reynolds, R. G., \"Using Cultural Algorithms to Support the Re-Engineering of Rule-Based Expert Systems in Dynamic Performance Environments: A Fraud Detection Example\", IEEE Transactions on Evolutionary Computation , Vol.1, No. 4, November, 1997, pp. 225-243." ], [ "Zannoni, E., and Reynolds, R. G., \"Learning to Control the Program Evolution Process in Genetic Programming Systems Using Cultural Algorithms\", Journal of Evolutionary Computation , Vol. 5, No. 2, October, 1997, pp. 181-211." ], [ "Reynolds, R. G., \"Evolution-Based Approaches to Software Engineering: An Introduction\", International Journal of Software Engineering and Knowledge Engineering , Vol. 5, No.2, June, 1995, pp. 161-164." ], [ "Reynolds, R.G., and Sverdlik, W., \"An Evolution-Based Approach to Program Understanding Using Cultural Algorithms\", International Journal of Software Engineering and Knowledge Engineering , Vol. 5, No.2, June, 1995, pp. 211-226." ], [ "Reynolds, R. G., and Maletic, J., \"The Use of Version Space Controlled Genetic Algorithms to Solve the Boole Problem\" International Journal on Artificial Intelligence Tools , Vol. 2, No. 2, June, 1993, pp. 219-234." ], [ "Reynolds, R. G., Maletic, J., and Porvin, S., \"Stepwise Refinement and Problem Solving\", IEEE Software , September 1992, pp. 79 -88." ], [ "Reynolds, R. G., and Zannoni, E., \"Extracting Procedural Knowledge From Software Systems Using Inductive Learning in the PM System\" International Journal on Artificial Intelligence Tools , vol. 1, No. 3, 1992, pp. 351-367." ], [ "Reynolds, R. G., \"Introduction to the Special issue on the Acquisition of Software Engineering Knowledge\", International Journal of Software Engineering and Knowledge Engineering , Vol. 1, No. 4, December 1991, pp. 327-329." ], [ "Reynolds, R. G., Esteva, J. C., \"Learning to Recognize Reusable Software by Induction\", International Journal of Software Engineering and Knowledge Engineering, vol. 1, No. 3, 1991, pp. 271-292." ], [ "Reynolds, R. G., Maletic, J., and Porvin, S., \"PM: A System to Support the Automatic Acquisition of Programming Knowledge\", IEEE Transactions on Knowledge Engineering and Data Engineering , Vol. 2 , No. 3, September 1990, pp. 273-282." ], [ "Reynolds, R. G., Maletic, J., and Porvin, S., \"The Acquisition of Software Engineering Knowledge using the PM System\", International Journal of Engineering Applications of Artificial Intelligence , April 1990, pp. 111-120." ], [ "Savatsky, K., and Reynolds, R. G., \"A Computer Model of the Evolution of Cooperation\", Biosystems , Vol. 23, 1989, pp. 261-279." ], [ "Reynolds, R. G., \"The Partial Metrics System: A Tool to Support the Metrics- Driven Design of Pseudo Code Programs\", Journal of Systems and Software , Vol. 9, No. 2, 1989." ], [ "Reynolds, R. G., \"The Partial Metrics System: Modeling the Stepwise RefinementProcess Using Partial Metrics\", Communications of the ACM , Vol. 30, No. 11, 1987, pp. 956-963." ], [ "Reynolds, R. G., \"A Metrics-Based Model for Reasoning About Pseudo Code Design\", Journal of Information and Software Technology , Vol. 29, No. 9, 1987, pp. 497-502." ], [ "Reynolds, R. G., \"A Production Systems Model of Hunter-Gatherer Resource Scheduling Adaptations\", European Journal of Operations Research , Volume 30, No. 3, June, 1987." ], [ "Reynolds, R. G., \"PMS: An Inference System to Monitor the Stepwise Refinement of ADA Pseudo Code\", IEEE-Expert , Vol. 2, no. 4, Winter 1986, pp. 43-49." ], [ "Reynolds, R. G. and Zeigler, B. P., \"A Hierarchical Information Processing Model for Adaptation to Technological Change\", Systems Research , Vol. 2, No. 4, 1985, pp. 309-318." ], [ "Reynolds, R. G., \"A Research Tool for Tracking the Stepwise Refinement of ADA Programs\", Software Engineering Notes , Vol. 10, No. 3, July 1985. pp. 76-94." ], [ "Reynolds, R. G., \" A Computational Model of Hierarchical Decision Systems\", Journal of Anthropological Archaeology , Academic Press, Vol. 3, September, 1984. pp. 159-189." ], [ "Reynolds, R. G. and G. Cichanowski, \"Metrics for the Comparison of Parallel Programs and Their Design Methodologies\", Information Processing and Management , Vol. 19, no. 1, 1984. pp. 317-332." ], [ "Reynolds, R. G., Metrics to Measure the Complexity of Partial Programs\", Journal of Systems and Software , Vol. 4, No. 1 1984. pp. 75-91." ], [ "Reynolds, R. G., \"On Modeling the Evolution of Hunter-Gatherer Decision- Making Systems\", Geographical Analysis , Vol. X, No. 1, January, 1978. pp. 31-46." ], [ "Reynolds, R. G. and S. I. Outcalt, \"The Double-Dependence Markov Chain as an Analog to the Auto Correlation Function For a Temporal Series - or Weather Wine and Tree Rings\", Geographical Analysis , Vol. VII. April 1975. pp. 205- 212." ], [ "Reynolds, R. G., \"The Application of the Log-Linear Model to the Analysis of Spatial Data\", Geographical Analysis , Vol. VI, April 1974. pp. 179-186." ] ] }, "Title" : "Refereed Journals" }, { "Contents" : { "Items" : [ [ "Waris, F., Reynolds, R.G., Game Theoretic Knowledge Distribution In Cultural Algorithms, submitted to." ], [ "Reynolds, R.G., Kinniard-Heether, L., Population Mechanism for Problem Solving in Cultural Algorithms, IEEE Symposium Series in Computational Intelligence, Hononlulu Hawaii, Novemeber 27 December 1, 2017." ], [ "Reynolds, R.G., Kinniard-Heether, L ., Problem Solving Using Social Networks in Cultural Algorithms with Auctions, 2017 IEEE World Congress on Computational Intelligence, June 5-8, Donostia - San Sebastian, Spain, 2017. Awad, N., Ali, M., Suganthan, P., Reynolds, R.G., and Shatnawi. A., A Novel Differential Crossover Strategy based on Covariance Matrix Learning with Euclidean Neighborhood for Solving Real-World Problems, 2017 IEEE 2016 World Congress on Computational Intelligence, June 5-8, Donostia - San Sebastian, Spain, 2017." ], [ "Awad, N., Ali, M., Suganthan, P., and Reynolds, R. G., An Ensemble Sinusoidal Parameter Adaptation incorporated with L-SHADE for Solving CEC2014 Benchmark Problems, 2016 World Congress on Computational Intelligence, July, 2016." ], [ "Gawasmeh, Y., Salaymeh, A. and Reynolds, R.G. The Impact of Subcultures in Cultural Algorithm Problem Solving, in the Proceeding of the IEEE Symposium Series in Computational Intelligence, South Africa, December 8-10, 2015." ], [ "Waris, Faisal, Reynolds, R.G., Using Cultural Algorithms to Improve Wearable Device Gesture RecognitionPerformance, in the Proceeding of the IEEE Symposium in Computational Intelligence, South Africa, December 8-10, 2015" ], [ "Ebrahimi, M., Mohan A., Lu S., and Reynolds, R. G., A Task Placement Strategy for Big Data Workflows, In Proceedings of the 2015 IEEE Big Data Conference, Santa Clara, CA, October 9-October 11, 2015. Waris, Faisal, Reynolds, R.G., Human Defined, Machine Optimized Gesture Recognition Using a Mixed Approach, in Proceedings of IEEE Workshop on SwarmHuman Blended Intelligence, Cleveland, Ohio, September 28-29, 2015." ], [ "Gawasmeh, Y., Reynolds, R.G., Subcultures as a New Role in Cultural Algorithm Design, in Proceedings of Collective Intelligence, Santa Clara, CA, May 31-June 2, 2015.." ], [ "Awad, N., Ali, M. and Reynolds, R. G., A Differential Evolution with Success-based Parameter Adaptation for Learning-based Optimization, Proceedings of 2015 IEEE Congress on Evolutionary Computation, Sendai, Japan, May 25-28, 2015." ], [ "Ali, M, Awad N., Duwairi, R, Albadarneh, J, Reynolds, R., and Suganthan, P, Cluster-Based Differential Evolution with Heterogeneous Influence for Numerical Optimization, in Proceedings of 2015 IEEE Congress on Evolutionary Computation, Sendai, Japan, May 25-28, 2015." ], [ "Gawasmeh, Y., Reynolds, R.G., A Computational Basis for the Presence of Sub-Cultures in Cultural Algorithms, in Proceedings of IEEE Symposium Series on Computational Intelligence, Orlando Florida, December 9-12, 2014" ], [ "Gawasmeh, Y., Reynolds, R.G., A Computational Basis for the Presence of Sub-Cultures in Cultural Algorithms, in Proceedings IEEE Symposium Series on Computational Intelligence, Orlando Florida, December 9-12, 2014." ], [ "Ali, M., Awad, N., Reynolds, R.G., Balancing Search Direction in Cultural Alorithm for Enhanced Global Optimization, in Proceedings of IEEE Symposium Series on Computational Intelligence, Orlando Florida, December 9-12, 2014." ], [ "Che, C., Reynolds, R. G., Monitoring the Vital Signs of a Complex Social System, Proceedings of 2014 IEEE World Congress on Computational Intelligence, July 6-11, 2014, Beijing, China." ], [ "Judeh T., Jayyousi T., Acharya L., Reynolds, R. G., and Zhu , Dongxiao, GSCA: Reconstructing Biological Pathway Topologies Using a Cultural Algorithms Approach, Proceedings of 2014 IEEE World Congress on Computational Intelligence, July 6-11, 2014, Beijing, China." ], [ "Ali, M, Morghem, Abdulmalik, AlBadarneh J., Al-Gharaibeh, R., Suganthan, P., and Reynolds, R.G., Cultural Algorithms Applied to the Evolution of Robotic Soccer Team Tactics: A Novel Perspective, Proceedings of 2014 IEEE World Congress on Computational Intelligence, July 6-11, 2014, Beijing, China." ], [ "Judeh, T., Acharya, L., Reynolds, R.G., and Zhu, D, 2013. Gene Set Cultural Algorithms: A Cultural Algorithms Approach to reconstruct networks from Gene Sets. In Proceedings of the ACM Conference on Bioinformatics, Computational Biology, and Biomedicine, BCB 2013, New York, NY, USA, ACM." ], [ "OShea, J., Lemke, A., Reynolds, R.G., Sonnenberg, E., Meadows, G., Approaches to the Archaeology of Submerged Landscapes: Research on the Alpena-Amberley Ridge, Lake Huron, in Proceedings of Curacao, Curacao, Mexico, November, 2013." ], [ "Shaker, N., Togelius, J., Yannakakis, G. N., Likith, Satish P. K., Ethiraj, V. S.,Johansson, S.J.,Reynolds, R.G., Kinnaird-Heether, L., Schumann T., and Gallagher, M., The Turing Test Track of the 2012 Mario AI Championship: Entries and Evaluation, IEEE Computational Intelligence in Games, August 5-8, Niagara Falls, Canada, 2013." ], [ "Jayyousi, T., and Reynolds, R.G., Using Cultural Algorithms to Generate Models of Ancient Urban Centers: The Monte Alban Example, in Proceedings of 2013 IEEE International Conference on Evolutionary Computation, Can-Cun, Mexico, June 17-20, 2013. Best Overall Paper Award." ], [ "Fogarty, J., Reynolds, R.G., OShea, J., Che, X. and Salaymeh, A., Serious Game Modeling of Caribou Behavior Across Lake Huron Using Cultural Algorithms and Influence Maps Proceedings of 2013 BMI the Second International Conference on Brain-Mind , Michigan State University, July 27-28, East Lansing, 2013." ], [ "Jayyousi, T., and Reynolds, R. G., Bringing to Life an Ancient Urban Center at Monte Alban, Mexico: Modeling the Emergence of Ancient Urban Centers. In Proceedings of International Conference on Brain Mind, Michigan State University, East Lansing, Michigan, July 14-15, 2012." ], [ "Reynolds, R.G., and Gawasmeh, Y., Evolving Heterogeneous Social Fabrics For The Solution Of Real Valued Optimization Problems Using Cultural Algorithms, in Proceedings 2012 IEEE World Congress on Computational Intelligence, Brisbane, Austrailia, June 9-15, 2012." ], [ "Ali M., Salhieh A., Reynolds, R. G., Socio-Cultural Evolution via Neighborhood Restructuring in Intricate Multi-Layered Networks, in Proceedings 2012 IEEE World Congress on Computational Intelligence, Brisbane, Austrailia, June 9-15, 2012." ], [ "Jayyousi, T., and Reynolds, R. G., Bringing to Life an Ancient Urban center at Monte Alban, Mexico: Exploiting the Synergy Between the Macro, Meso, and Micro Levels in a Complex System, in Proceedings of First International Conference on Complexity and Human Experience: Modeling Complexity in the Humanities and Social Sciences, Complexity in the Humanities and Social Sciences, University of North Carolina-Charlotte, May 30 June 1, 2012." ], [ "Ali, M., and Reynolds, R. G., The Emergence of Social Complexity in Optimizing Mechanical Design Problems via Cultural Algorithms, in Proceedings of Advance Topics in Artificial Intelligence, Singapore, November 14-16, 2011." ], [ "Ali, M., Salhieh, A., and Reynolds, R. G., The Emergence of Cultural Hierarchical Social Networks in Deceptive Environments, Proceedings of International Paris, France, November 14-16, 2011. Conference on Computers, Electrical, and Systems Science, and Engineering." ], [ "Vitale, K., Reynolds, R. G., OShea, J., and Meadows, G., Exploring Ancient Landscapes Under Lake Huron Using Cultural Algorithms, in Procedia Computer Sciences, Elsevier Press, Chicago, IL, November 1-3, 2011." ], [ "Reynolds, R.G., and Liu D., Multi-Objective Cultural Algorithms, Proceedings of IEEE 2011 Congress on Evolutionary Computation, New Orleans, Louisiana, June 6-9, 2011." ], [ "Ali, M., Salhieh A., Snaineh R. A., and Reynolds, R.G., Boosting Cultural Algorithms with an Heterogeneous Layered Social Fabric influence Function, Proceedings of IEEE 2011 Congress on Evolutionary Computation, New Orleans, Louisiana, June 6-9, 2011." ], [ "Reynolds, R. G., Gawasmeh, Y ., Evolving Heterogeneous Social Fabrics for the Solution of Real Valued Optimization Problems Using Cultural Algorithms, Eighth International Conference on Complex Systems, June 26- July 1, 2011." ], [ "Snaineh R ., Younes A., Ali, M., Salhieh A., and Reynolds, R. G., I-Architect A Virtual Reality CAD System 3rd Annual Undergraduate Research Conference on Applied Computing College of Information Technology, Zayed University, Dubai, UAE, May 4-5, 2011." ], [ "Vitale, K., Reynolds, OShea, J., Che X., Learning Group Behavior in Games Using Cultural Algorithms: The Land Bridge Example, Proceedings of the Third IEEE Spring Symposium on Computational Intelligence SSCI, Paris, France, April 11-15, 2011, IEEE Press, pp.: 147-155, 2011." ], [ "Che X., Ali M., Reynolds, R. G. Weaving the Social Fabric: The Past, Present and Future of Optimization Problem Solving with Culture Algorithms, Proceedings of AAAI Fall 2010 Symposium, Arlington, VA, November 11 -13, 2010" ], [ "Ali, M., Reynolds, R.G., and Ali, R., Enhancing Cultural Learning under Environmental Variability Using Layered Heterogeneous Sociometry-Based Networks in Proceedings IEEEACM on Web Intelligence Intelligent Agent Technology, Toronto, CA, August 31-Sept. 3, 2010." ], [ "Reynolds, R.G., Che, X., and Ali, M., Weaving the Social Fabric: The Past, Present and Future of Optimization Problem Solving with Culture Algorithms, to appear in Proceedings AAAI Fall Symposium on Complex Adaptive Systems, November 10-12, 2010." ], [ "Xiangdong Che, Ali M., Reynolds R. G., Robust Evolutionary Optimization at the Edge of Chaos: Commercialization of Cultural Algorithms, IEEE World Congress on Computational Intelligence, Barcelona, Spain, July 18 -23, 2010." ], [ "Best C., Che X., Robert G. Reynolds, and X. Liu, Multi-Objective Cultural Algorithms, IEEE World Congress on Computational Intelligence, Barcelona, Spain, July 18 -23, 2010." ], [ "Ali M., Reynolds R. G., \"An Intelligent Social Fabric Influence Component in Cultural Algorithms for Knowledge Learning in Dynamic Environments,\" Web Intelligence and Intelligent Agent Technology, IEEEWICACM International Conference on Web Intelligence and Intelligent Agent Technology, vol. 2, pp. 161-168, 2009." ], [ "Ali M., Khamayseh Y., Reynolds R. G., \"Cultural Swarms - Knowledge-driven Framework for Solving Nonlinearly Constrained Global Optimization Problems,\" International Conference on Evolutionary Computation, pp. 103-110, 2009 International Joint Conference on Computational-Intelligence, ICEC 09, Madeira, Portugal 2009." ], [ "OShea, J., Meadows, G., Reynolds, R., and R. Eustice, Mapping Ancient Landscapes and Hunting Sites, Geological Society of America, Abstracts, Vol: 417: 77, 2009." ], [ "Loiacono, D, Togelius, J., Luca Lanzi, P., Kinnaird-Heether, L., Lucas, S., Simmerson, M., Perze, D. Reynolds, R. G., and Saez, Y., Proceedings of IEEE Symposium on Computational Intelligence in Games, Perth, Australia, December 15-18, 2008." ], [ "Reynolds, R. G., and Ali, M., Embedding a Social Fabric Component into a Cultural Algorithms Toolkit, Proceedings of the International Workshop on Advanced Computational IntelligenceIWACI2008 ,University of Macau, Taipa, Macao, June 7-8, 2008." ], [ "Reynolds, R.G., and Ali, M., The Social Fabric Approach as an Approach to Knowledge Integration in Cultural Algorithms, 2008 Proceedings of IEEE World Congress on Computational Intelligence, Hong Kong China, June 1-6, 2008." ], [ "Reynolds, R.G., and Ali, M., Cultural Algorithms: Knowledge-Driven Engineering Optimization via Weaving a Social Fabric as an Enhanced Influence Function, Proceedings of 2008 IEEE World Congress on Computational Intelligence, Hong Kong China, June 1-6, 2008." ], [ "Reynolds, R.G., and Ali, M., Exploring Knowledge and Population Swarms Using an Agent-Based Cultural Algorithm Simulation Toolkit CAT, in Proceedings of 2007 IEEE International Congress on Evolutionary Computation, Singapore, September 25-29, 2007." ], [ "Reynolds, R.G., and Ali, M., The Cultural Algorithm Simulation Toolkit: A New Approach for Solving Optimization Problems, in Proceedings of NAACSOS Conference, Atlanta Georgia, June 5-7, 2007." ], [ "Reynolds, R.G., and Fotouhi, F., The Urbarium, in Proceedings 2007 IEEE Symposium on Swarm Intelligence, Honolulu, Hawaii, April 1-5, 2007." ], [ "Reynolds, R.G., and Peng, B., A Tribute to C. V. Ramamoorthy: Knowledge Integration On-The-Fly in Swarm Intelligent Systems, in Proceedings of 2006 IEEE International Conference on Tools for Artificial Intelligence, Arlington, VA., November 13-15, 2006, pp: 197-208." ], [ "Reynolds, R.G. and Franzel, P., Modelling the Semantics of Emergent Urban Centers, in Proceedings of AGENTS 2006, Chicago, Illinois, September 21-23, 2006." ], [ "Reynolds, R.G., Peng, B., and Alomari, R., Cultural Evolution of Ensemble Learning for Problem Solving, Proceedings of the IEEE World Congress on Computational Intelligence, Vancouver, B.C., July 16-21, 2006." ], [ "Reynolds, R.G., Whallon, R., Ali, M., Zadegan, B., Agent Based Modeling of Early Cultural Evolution, Proceedings of the IEEE World Congress on Computational Intelligence, Vancouver, B.C., July 16-21, 2006." ], [ "Reynolds, R.G., Ali, M., and Alomari, R., Optimization Problem Solving using PredatorPrey Games and Cultural Algorithms, in Proceedings of the 2006 IEEE Symposium on Computational Intelligence and Games, Ed. S.J. Louis and G. Kendall, RenoLake Tahoe, Nevada, May 22-24, 2006, pp: 119-125." ], [ "Reynolds, R.G., Peng, B., and Alomari, R., The Role of Culture in the Emergence of Decision-making Roles: An Example using Cultural Algorithms, in IEEE Proceedings of 2006 Symposium on Swarm Intelligence, Indianapolis Indiana, May 10-12, 2006." ], [ "Reynolds, R.G., and Peng, B., Knowledge Swarms: Generating Emergent Social Structure in Dynamic Environments, AGENTS 2005 Conference on Generative Social Processes, Models, and Mechanisms, Chicago, Illinois, October 13-15, 2005." ], [ "Reynolds, R. G., Kobti, Z. and Kohler, T., \"Learning in Dynamic Multi-Layered Social Networks: A Mesa Verde Example\", in Proceedings of Geo-Computation 2005, Ann Arbor Michigan, August 1-3, 2005." ], [ "Kobti, Z., Reynolds, R.G., and Kohler, T., The Emergence of Complex Hierarchical Hub Social Networks in the Mesa Verde Village Simulation Using Cultural Learning, in Proceedings of 2005 AAAI FLAIRS Conference, May15-17, 2005, Clearwater Beach, Florida." ], [ "Reynolds, R.G., and Peng, B., Cultural Algorithms: Modeling How Cultures Learn to Solve Problems, IEEE International Conference on Tools with Artificial Intelligence, Boca Raton, FL, November 15-17, 2004, pp. 166-173." ], [ "Reynolds, R.G., Kobti, Z., and Kohler, T., The Emergence of Social Complexity in Mesa Verde Using Cultural Learning in the Presence of Balanced and reciprocal Exchange Networks, Argonne Laboratory Conference on Social Dynamics, Interaction, Reflexivity, and Emergence, Chicago, IL, October 7-9, 2004." ], [ "Ostrowski, D., and Reynolds, R. G., Using Cultural Algorithms to Evolve Strategies for Recessionary Markets, in Proceedings of IEEE International Congress on Evolutionary Computation, Portland, OR, June 19-24, 2004, pp: 1780-1785." ], [ "Reynolds, R. G., Kobti, Z. , and Kohler, T., The Effect of Culture on the Resilience of Social Systems in the Village Multi-Agent Simulation, in Proceedings of IEEE International Congress on Evolutionary Computation, Portland, OR, June 19, 24, 2004, pp: 1743-1750." ], [ "Brewster, J., and Reynolds, R. G., Alternative Fuel Adoption, in Proceedings of IEEE International Congress on Evolutionary Computation, Portland, OR, June 19, 24, 2004, pp: 2364-2371." ], [ "Peng, B. and Reynolds, R. G., Knowledge Learning in Dynamic Environments, in Proceedings of IEEE International Congress on Evolutionary Computation, Portland, OR, June 19, 24, 2004, 1751-1758." ], [ "Peng, B. and Reynolds, R. G., The Role of Culture in the Emergence of Decision-Making Roles: An Example Using Cultural Algorithms, to appear in Proceedings of NECSI International Conference on Complex Systems, Boston MA., May 16-21, 2004." ], [ "Peng, B. and Reynolds, R. G., Cultural Algorithms: Computational Modeling of How Cultures learn to Solve Problems , Seventeenth European Meeting on Cybernetics and Systems Research, Vienna, Austria, April13-16, 2004." ], [ "W. Grosky, F. Fotouhi, A. Aristar, S. Lu, M. Dong and R. Reynolds, A Digital Library for Endangered Languages, Extended Abstract, Proceedings of Nara Symposium for Digital Silk Roads, December 2003, Nara, Japan, pp. 22-24" ], [ "Reynolds, R.G., Stefan, J., Fotouhi F., Lu S., Dong, M., and Aristar, T., Evolution-Based Approaches to the Preservation of Endangered Natural Languages, Proceedings 2003 IEEE Proceedings of Congress on Evolutionary Computation, Canberra, Australia, December 8-12, 2003." ], [ "Peng, B., Reynolds, R. G., and Brewster, J., Cultural Swarms, Proceedings 2003 IEEE Proceedings of Congress on Evolutionary Computation, Canberra, Australia, December 8-12, 2003." ], [ "Peng, B. and Reynolds, R. G., and Brewster, J., Cultural Swarms II: Virtual Algorithm Emergence, Proceedings 2003 IEEE Proceedings of Congress on Evolutionary Computation, Canberra, Australia, December 8-12, 2003." ], [ "Kobti, Z., Reynolds, R.G., and Kohler, T., A Multi-Agent Simulation Using Cultural Algorithms: The Effect of Culture on the Resilience of Social Systems, Proceedings 2003 IEEE Proceedings of Congress on Evolutionary Computation, Canberra, Australia, December 8-12, 2003." ], [ "Peng, B Reynolds, R. G., and Brewster, J., Cultural Swarms: Knowledge-Driven Problem Solving in Social Systems, Proceedings IEEE Conference on Systems, Man, and Cybernetics, Washington, D.C., October 5-9, 2003." ], [ "Reynolds, R. G., Stefan, J., Web Services, Web Search, and Cultural Algorithms, Proceedings 2003 IEEE Conference on Systems, Man, and Cybernetics, Washington, D.C., October 5-9, 2003." ], [ "Kobti, Z., Reynolds, R.G., and Kohler, T., Finding the Center Place: A Multi-Agent Simulation of the Emergence of Social Networks in the Mesa Verde Region Using Cultural Algorithms, Proceedings of AGENTS 2003 Conference, Chicago, Illinois, October 3-4, 2003." ], [ "Kim, S., and Reynolds, R.G., The Relative Impact of Craft Production, Trade, and Warfare on the Formation of the Archaic State , The Korean Society for Simulation Spring Conference, College of Engineering, Hannam University, Taejon, South Korea, June 21, 2003." ], [ "Reynolds, R.G., and Kobti, Z., and Kohler, T., The Effects of Generalized Reciprocal Exchange on the Resilience of Social Networks, 2 nd North American Conference on Agent Computation and Organization NAACSOS, Carnegie-Mellon University, Pittsburgh, PA., June 22-26, 2003." ], [ "Kobti, Z, and Reynolds, R. G.., \" A Multi-Agent Simulation Using Cultural Algorithms: The Effect of Culture on the Resilience of Social Systems\", Sant Fe Institute Workshop on Human Environmental Interaction, May 15-18, 2003." ], [ "Reynolds, R. G., and Ostrowski, D. A., Using Software Engineering Knowledge to Drive Genetic Programming Design using Cultural Algorithms, University of Michigan Complex Systems Workshop on Genetic Programming, Ann Arbor, Michigan, May 15-17, 2003." ], [ "Rychtyckyj, N., Reynolds, R., Ostrowski, D., and Schleis, G., Using Cultural Algorithms in Industry, Proceedings of IEEE Swarm Intelligence Symposium, Indianapolis Indiana, April 24-26, 2003." ], [ "Reynolds, R.G., Brewster, J., and Iacoban, R., Cultural Swarms: Modeling the Impact of Culture on Social Interaction and Problem Solving, IEEE Swarm Intelligence Symposium, Indianapolis Indiana, April 24-26, 2003, pp: 205-209." ], [ "Reynolds, R. G., Brewster, J., and Iacoban, R., Cultural Swarms: Assessing the Impact of Culture on Social Interaction and Problem Solving, IEEE Swarm Intelligence Symposium, Indianapolis Indiana, April 24-26, 2003, pp: 210-219." ], [ "Reynolds, R.G., Predicting the Past Using Multi-Agent Models of Cultural Evolution, Midwest Sociological Society, Chicago, IL., April 16-19, 2003." ], [ "Kobti Z., and Reynolds, R. G., \"The Effect of Environmental Variability on the Resilience of Social Networks: An Example Using the Mesa Verde Pueblo Culture\", Society for American Archaeology, 68th Annual Meeting, April 9-13, 2003." ], [ "Whallon, R, Reynolds, R.G., and Goodhall, S. J., Simulation of Economic Sharing in Pre- or Proto-Cultural Foraging Groups, Society for American Archaeology 68 th Annual Meeting, Milwaukee, Wisconsin, April 9-13, 2003." ], [ "Reynolds, R. G., Agent-Based Simulation of the Evolution of Archaic States, The Second UCLA Lake Arrowhead Conference on Complex Human Complex Systems, March 19-23, 2003." ], [ "Jin, X., and Reynolds, R. G., Data Mining Using Cultural Algorithms and Regional Schemata, IEEE International Conference on Tools for Artificial Intelligence, Washington, D.C., November 2-5, 2002, pp: 33-40." ], [ "Goodhall, S.J., Reynolds, R., and Whallon, R, The Impact of Resource Allocation Strategies on Pre-Hominid Group Survival, Proceedings of the Agent 2002 Conference on Social Agents: Ecology, Exchange, and Evolution, Chicago, Illinois, October 11-12, 2002, p: 247-264." ], [ "Reynolds, R.G., Lazar, A., and Kim, S., The Agent-Based Simulation of the Evolution of Archaic States, , Proceedings of the Agent 2002 Conference on Social Agents: Ecology, Exchange, and Evolution, Chicago, Illinois, October 11-12, 2002, p:265-282." ], [ "Ostrowski, D., Reynolds, R., Tassier, T., Everson, M., Using Cultural Algorithms to Evolve Strategies in Agent-Based Models, Proceedings of World Congress on Computational Intelligence, May 12-19, 2002, Honolulu, Hawaii." ], [ "Brewster, J., Reynolds, R., and Brockmeyer, M., Not in My Backyard: A Simulation of the Effects of Agent Mobility on Environmental Poisoning, Proceedings of World Congress on Computational Intelligence, May 12-19, 2002, Honolulu, Hawaii." ], [ "Rychtyckyj, N., and Reynolds, R. G., Knowledge base Maintenance Using Cultural Algorithms: Application to the DLMS Manufacturing Process System, Proceedings of World Congress on Computational Intelligence, May 12-19, 2002, Honolulu, Hawaii." ], [ "Lazar, A., and Reynolds, R. G.,Simulating the Evolution of the Archaic State, Proceedings of World Congress on Computational Intelligence, May 12-19, 2002, Honolulu, Hawaii." ], [ "Reynolds, R. G. , Whallon, R., and Goodhall, S. The Impact of Resource Access on Learning by Emulation in Hunter-Gatherer Foraging Systems: A Multi-Agent Model, Proceedings of World Congress on Computational Intelligence, May 12-19, 2002, Honolulu, Hawaii." ], [ "Lazar, A., and Reynolds, R. G, A Computational Framework for Modeling the Dynamic Evolution of Large-Scale Multi-Agent Organizations Proceedings SPIE Conference on Enabling Technologies for Simulation Science, April 1-5, 2002." ], [ "Reynolds, R., and Lazar, A., Evolution-Based Learning of Ontological Knowledge for a Large-Scale Multi-Agent Simulation, Proceedings of 4 th International Workshop on Frontiers in Evolutionary Computation, Duke University, March 11-13, 2002." ], [ "Reynolds, R.G., Knowledge Swarms and Cultural Evolution, Proceedings of American Anthropological Association Annual Meeting, November 28-31, 2001, Washington, D.C." ], [ "Rychtyckyj, N., and Reynolds, R.G., Bottom-Up Re-Engineering of Semantic Networks using Cultural Algorithms, Proceedings of GECCO 2001, San Francisco, California, July 7-11, 2001." ], [ "Saleem, S., and Reynolds, R.G., Function Optimization with Cultural Algorithms in Dynamic Environments, IEEE Proceedings of the Particle Swarm Optimization Workshop, Indianapolis, Indiana, April 6-7, 2001, pp: 63-79." ], [ "Reynolds, R.G., Goodhall, S., Whallon, R., Modeling Imitative Learning in a Multi-Agent System Using Cultural Algorithms and Swarm, Proceedings of Agent Simulation 2000: Applications, Models, and Tools, Chicago, Illinois, October 5-7, 2000." ], [ "Reynolds, R.G., Goodhall, S., Whallon, R., Transmission of Cultural Traits by Emulation, Proceedings of the Symposium on Modeling and Simulating of Cultural Transmission and Change, Sienna, Italy, September 2-4, 2000" ], [ "Rychtyckyj, N., and Reynolds, R.G., Assessing the performance of Cultural Algorithms for Semantic Network Re-engineering, Proceedings of the Congress on Evolutionary Computation, San Diego, California, July 16-19, 2000, Vol. 2, pp: 1482-1491." ], [ "Jin, X., and Reynolds, R.G., Mining Knowledge in Large-Scale Databases Using Cultural Algorithms with constraint handling Mechanisms, Proceedings of the Congress on Evolutionary Computation, San Diego, California, July 16-19, 2000, Vol. 2, pp: 1498-1506." ], [ "Saleem, S., and Reynolds, R.G., Cultural Algorithms in Dynamic Environments, Proceedings of the Congress on Evolutionary Computation, San Diego, California, July 16-19, 2000, Vol. 2, pp: 1513-1520." ], [ "Jin, X., and Reynolds, R.G., Using Knowledge-Based System with a Hierarchical Architecture to guide the Search of Evolutionary Computation, Proceedings of the Eleventh IEEE Conference Tools with Artificial Intelligence, Chicago, Il, Nov. 10-12, 1999." ], [ "Jin, X., and Reynolds, R.G., Solving Constrained Real-Valued Function Optimization Problems using a Cultural Algorithm, Proceedings ANNIE 1999, St. Louis, Mo., Nov. 7-9, 1999, pp: 29-36." ], [ "Rychtyckyj, N., and Reynolds, Using Cultural Algorithms to Improve Performance in Semantic Networks, Proceedings 1999 IEEE Congress on Evolutionary Computation, Washington, D. C., July 6-9, 1999, pp. 1651-1656." ], [ "Ostrowski, D., and Reynolds, R.G., Knowledge-Based Software Testing Agent Using Evolutionary Learning with Cultural Algorithms, in Proceedings 1999 IEEE Congress on Evolutionary Computation, Washington, D. C., July 6-9, 1999, pp. 1657-1663." ], [ "Cowan, G., and Reynolds, R.G., The Metrics Apprentice: Using Cultural Algorithms to Formulate Quality Metrics for Software Systems, in Proceedings 1999 IEEE Congress on Evolutionary Computation, Washington, D. C., July 6-9, 1999, pp. 1664-1671." ], [ "Jin, X., and Reynolds, R.G., Using Knowledge-Based Evolutionary Computation to Solve Non-Linear Optimization Problems: A Cultural Algorithm Approach, in Proceedings 1999 IEEE Congress on Evolutionary Computation, Washington, D. C., July 6-9, 1999, pp. 1672-1678." ], [ "Cowan, G., and Reynolds, R.G., Learning to Assess the Quality of Genetic Programs Using Cultural Algorithms, in Proceedings 1999 IEEE Congress on Evolutionary Computation, Washington, D. C., July 6-9, 1999, pp. 1679-1686." ], [ "Reynolds, R. G., On the Evolution of Schemata for Function Optimization, in Holland Fest: New Directions in Evolutionary Computation Inspired by the Work of John Holland, Ann Arbor, Michigan, May 16-18, 1999" ], [ "Reynolds, R.G., and Chung, Chan-Jin, A Knowledge-Based Approach to Self-Adaptation in Evolutionary Search Using Cultural Algorithms, in Proceedings of the 12 th International FLAIRS Conference, Orlando, Florida, May 3-6, 1999." ], [ "Cowan, G., and Reynolds, R.G., Evolving Distributed Software Engineering Environments, in Proceedings 17 th IEEE Symposium on Reliable Distributed Systems, West Lafayette, Indiana, October 20-23, 1998, pp: 151-160." ], [ "Reynolds, R.G., and Zhu, S., The Impact of Fuzzy Knowledge Representation on Problem Solving in Fuzzy Cultural Algorithms with Evolutionary Programming, Proceedings of Genetic Programming Conference, Madison, Wisconsin, July 22-25,1998, Morgan Kaufmann Press." ], [ "Reynolds, R.G., and Zhu, S., The Design of Fully Fuzzy Cultural Algorithms with Evolutionary Programming for Real-Valued Function Optimization, Proceedings of Genetic Programming Conference, Madison, Wisconsin, July 22-25, 1998, Morgan Kaufmann Press." ], [ "Reynolds, R.G., and Al-Shehri, H., Data Mining of Large-Scale Spatio- Temporal Databases Using Cultural Algorithms, Proceedings of 1998 IEEE World Congress on Computational Intelligence, Anchorage, Alaska, May 4-9, 1998." ], [ "Rychtychyj, N., and Reynolds, R.G., Learning to Re-Engineer Semantic Networks Using Cultural Algorithms, Proceedings of Seventh Annual Conference on Evolutionary Programming, San Diego, California, March 26-29, 1998." ], [ "Ostrowski, D., and Reynolds, R.G., Developing Software Engineering Environments for Genetic Programming Systems Using Cultural Algorithms, Proceedings of Seventh Annual Conference on Evolutionary Programming, San Diego, California, March 26-29, 1998." ], [ "Chung, C., and Reynolds, R.G., Culturing Evolution Strategies to Support the Exploration of Novel Environments by an Intelligent Robotic Agent, Proceedings of Seventh Annual Conference on Evolutionary Programming, San Diego, California, March 26-29, 1998." ], [ "Zhu, S., and Reynolds, R.G., Fuzzy Cultural Algorithms with Evolutionary Programming, Proceedings of Seventh Annual Conference on Evolutionary Programming, San Diego, California, March 26-29, 1998." ], [ "Reynolds, R.G., and Chung, Chan Jin, \"Knowledge-Based Self Adaptation in Evolutionary Search\", Proceedings of 1997 IEEE International Conference on Artificial Intelligence Tools, Newport Beach, November 4-7, 1997." ], [ "Reynolds, R.G., and Al-Shehri, H., The Use of Cultural Algorithms with Evolutionary Programming to Control the Data Mining of Large-Scale Spatio- Temporal Databases, 1997 IEEE International Conference on Systems, man, and Cybernetics, Orlando, Florida, October 15, 1997" ], [ "Reynolds, R. G., and Chung, Chan Jin, \"The Importance of Functional Complexity in Regulating the Amount of Information Required to Guide Self-Adaptation in Cultural Algorithms, Proceedings 1997 International Conference on Genetic Algorithms, East Lansing, Michigan, July, 1997, pp. 401-408." ], [ "Reynolds, R.G., Chung, Chan Jin, \"Knowledge-Based Self-Adaptation in Evolutionary Programming Using Cultural Algorithms\", Proceedings of 1997 IEEE International Conference on Evolutionary Computation, Indianapolis, Indiana, April, 1997, pp. 71-76." ], [ "Reynolds, R. G., and Chung, Chan-Jin, \"A Cultural Algorithm Framework for Evolving Multi-Agent Cooperation Using Evolutionary Programming\", Proceedings of International Conference on Evolutionary Programming, Indianapolis, Indiana, 1997, pp. 323-334." ], [ "Reynolds, R. G., and Nazzal, Ayman, \"Using Cultural Algorithms with Evolutionary Computing to Extract Site Location Decisions from Spatio-Temporal Databases\", Proceedings of International Conference on Evolutionary Programming, Indianapolis, Indiana, 1997, pp. 443-456." ], [ "Reynolds, R.G., and Zannoni, E., \"Evolving Software Design Methodologies in Automatic Programming Systems Using Cultural Algorithms\", Proceedings of Second World Congress on Integrated Design and Process Technology\", Austin Texas, December 1-4, 1996." ], [ "Reynolds, R. G., and Chung, Chan-Jin, \"Function Optimization Using Evolutionary Programming with Self-Adaptive Cultural Algorithms, Proceedings of First Asian-Pacific Conference on Simulated Evolution and Learning, Taejon, Korea, November 8 -12, 1996." ], [ "Reynolds, R.G. and Chung Chan-Jin, \"The Use of Cultural Algorithms to Evolve Multi-agent Cooperation\", Proceedings of 1996 World Cup Soccer Tournament, Taejon, Korea, November 8 -12,1996." ], [ "Reynolds, R. G., and Chung, Chan-Jin, \"The Use of Cultural Algorithms to Support Self-Adaptation in Evolutionary Programming\", Proceedings of 1996 Adaptive Distributive Parallel Computing Symposium, Dayton, Ohio, August 8-9, 1996, pp. 260-271." ], [ "Reynolds, R.G., Chung, Chan Jin, \"A Self-Adaptive Approach to Representation Shifts in Cultural Algorithms\", Proceedings of 1996 IEEE International Conference on Evolutionary Computation, May 20-22, Nagoya, Japan, pp. 94-99." ], [ "Reynolds, R. G., and Chung, Chan Jin, \"A Test Bed for Solving Optimization Problems Using Cultural Algorithms\", Proceedings of Fifth Annual Conference on Evolutionary Programming, February 29-March 2, 1996, San Diego, California." ], [ "Reynolds, R. G., and Zannoni, Elena, \"Extracting Design Knowledge from Genetic Programs Using Cultural Algorithms\", Proceedings of Fifth Annual Conference on Evolutionary Programming, February 29-March 2, 1996, San Diego, California." ], [ "Reynolds, R. G., and Rolnick, S. R., \"Learning the Parameters for a Gradient-Based Approach to Image Segmentation from the Results of a Region Growing Approach Using Cultural Algorithms\", 1995 IEEE International Conference on Evolutionary Computation, November 29-December 1, 1995, Perth, Australia, pp. 1135-1143." ], [ "Reynolds, R. G., Rolnick, S. R., \"Learning the Parameters to a Gradient-Based Approach to Image Segmentation Using Cultural Algorithms\", Proceedings of the International Symposium on Intelligence in Neural and Biological Systems, May 29 - 31, 1995, Herndon, Virginia, pp. 240-247." ], [ "Reynolds, R.G., \"Solving Design Problems Using Cultural Algorithms\", Proceedings of the Eighth Florida Artificial Intelligence Research Symposium, April 27-29, 1995, Melbourne, Florida, pp. 279-283." ], [ "Maletic, J.I, and Reynolds, R. G., \"A Tool to Support Knowledge-Based Software Maintenance: The Software Service Bay, Proceedings of the 6th International Conference on Tools with Artificial Intelligence, November 6-9, 1994, New Orleans, Louisiana, pp. 11-17." ], [ "Reynolds, R. G., and Sverdlik, W., \"Problem Solving Using Cultural Algorithms\", Proceedings of 1st IEEE World Congress on Computational Intelligence, June 26- July 2, 1994, Orlando, Florida, pp. 1004-1008." ], [ "Reynolds, R. G., and Zannoni, E., \"Learning to Understand Software From Examples using Cultural Algorithms\", Proceedings of the 6th International Conference on Software Engineering and Knowledge Engineering, Riga, Latvia, June 21-23, 1994, pp. 188-192." ], [ "Reynolds, R. G., and Cavaretta, M., \"Discovering Search Heuristics for Concept Learning Using Version Space Guided Genetic Algorithms\", Proceedings of Florida Artificial Intelligence Research Symposium, Pensacola, Florida, May 5-7, 1994, pp. 183-192." ], [ "Reynolds, R. G., \"An Introduction to Cultural Algorithms\", Proceedings of the Third Annual Conference on Evolutionary Programming, February 24-26, 1994, San Diego, California, pp. 131-139." ], [ "Reynolds, R. G., Maletic, J., \"Learning to Cooperate Using Cultural Algorithms\", Proceedings of the Third Annual Conference on Evolutionary Programming, February 24-26, 1994, San Diego, California, pp. 140-149." ], [ "Reynolds, R. G., Brown W., Abinoja, E., \"Guiding Parallel Bidirectional Search Using Cultural Algorithms\", Proceedings of the Third Annual Conference on Evolutionary Programming, February 24-26, 1994, San Diego, California, pp. 167- 174." ], [ "Reynolds, R.G., Zannoni, E., Posner, R., \"Learning to Understand Software Using Cultural Algorithms\", Proceedings of the Third Annual Conference on Evolutionary Programming, February 24-26, 1994, San Diego, California, pp. 150- 157." ], [ "Reynolds, R. G., and Sverdlik, W., \"Incorporating Domain Specific Knowledge into Version Space Search\", Proceedings of the Second World Congress on Expert Systems, Lisbon, Portugal, January 10-14, 1994." ], [ "Sverdlik, W., and Reynolds, R. G., \"Scaling Up Version Spaces by Using Domain Specific Algorithms\", Fifth International Conference on Tools for Artificial Intelligence, November 8-11, 1993, pp. 216-223." ], [ "Reynolds, R. G., and Maletic, J. I., \"Metrics to Assess Programming Language Support for the Stepwise Refinement Process\", Proceedings of 5th International Conference on Software Engineering and Knowledge Engineering, San Francisco, California, June 17-19, 1993, pp. 150-157." ], [ "Reynolds, R. G., and Sverdlik, W., \"Learning the Behavior of Boolean Circuits From Examples Using Cultural Algorithms\", Proceedings of Second Adaptive and Learning Systems Conference, SPIE International Symposium on Aerospace and Remote Sensing, Orlando, Florida, April 12-16, 1993, 177-188.." ], [ "Reynolds, R. G., and Ghezevat, H., \"The Inductive Learning of Software Metrics From Examples, Proceedings of the Fifth Annual Oregon Workshop on Software Metrics, Silver Falls, Oregon, March 21-23, 1993, pp. 110- 118." ], [ "Reynolds, R. G., and Sverdlik, W., \"Solving Problems in Hierarchical Systems Using Cultural Algorithms\", Proceedings of Second Annual Conference on Evolutionary Programming, La Jolla, California, February 27 - 29, 1993, pp. 144- 153." ], [ "Sverdlik, W., and Reynolds, R. G. \"Dynamic Version Spaces in Machine Learning\", Proceedings of 1992 IEEE Conference on Tools for Artificial Intelligence, Arlington, Virginia, November 10-13, 1992." ], [ "Reynolds, R. G., Maletic J. I., and Zannoni, E., \"The Acquisition and Management of Reusable Software in the PM System\", Proceedings of the First International Conference on Information and Knowledge Management, Baltimore, Maryland, November 8-10, 1992, pp. 209-213." ], [ "Reynolds, R. G., Maletic, J. I., Zannoni, E., and Cowan, G., \"Software Reuse in the PM System\", in Proceedings of 5th Annual Workshop on Software Reuse, Palo Alto, California, October 26-29, 1992." ], [ "Reynolds, R. G., Maletic, J. I,, Zannoni, E., \"Operationalizing Software Reuse as a Problem in Machine Learning\", in Proceeding of the 5th International Conference on Industrial and Engineering Applications of Artificial Intelligence and Expert Systems, June 9-12, 1992, Paderborn, Germany, Lecture Notes in Artificial Intelligence, No. 604, Springer-Verlag Press, Berlin, 1992, pp. 143-153." ], [ "Reynolds, R. G., Maletic J. I., and Zannoni, E, \"Extracting Procedural Knowledge from Software Systems Using Inductive Learning Techniques\", in Proceedings of the 4th International Conference on Software Engineering and Knowledge Engineering, Capri, Italy, Jun. 15-20, 1992, IEEE Computer Society Press, Los Alamitos, CA, 1992, pp. 131-139." ], [ "Sverdlik, W., Reynolds, R. G., and Zannoni, E, \"HYBAL: A Self-Tutoring Algorithm for Concept Learning in Highly Autonomous Systems\", in Proceedings of 3rd Conference on Artificial Intelligence, Simulation and Planning in High Autonomy Systems, Perth, Australia, July 8-10, 1992, IEEE Computer Society Press, Los Alamitos, CA, 1992, pp. 15-22." ], [ "Reynolds, R. G., \"Position Statement on the Future of Software Reuse\", in Proceedings of the 4th International Conference on Computers and Information, Toronto, Canada, May 25-27, 1992, IEEE Computer Society Press, Los Alamitos, CA, 1992, pp. xvi." ], [ "Reynolds, R. G., and Zannoni, E, \"Why Cultural Evolution Can Proceed Faster than Biological Evolution\", in Proceeding of International Symposium on Simulating Societies, Surrey, England, April 2-3, 1992, pp. 81-93." ], [ "Reynolds, R. G., Maletic, J. I,, Zannoni, E., \"Operationalizing Software Reuse as a Problem in Machine Learning, Proceeding of Florida AI Research Symposium FLAIRS, Fort Lauderdale, Florida, April 7-10, 1992, pp. 190-194." ], [ "Reynolds, R. G., Chang, S., and Maletic, J. I., \"The Use of Version Space Controlled Genetic Algorithms to Solve the Boole Problem\", Proceedings of the Third International Conference on Tools for AI, San Jose, CA, Nov. 12-15, 1991, pp. 14-21." ], [ "Reynolds, R. G., and Maletic, J. I. \"The PM System: An Approach to Operationalizing Software Reuse as a Problem in Machine Learning\", Proceedings of AAAI Workshop on Automating Software Design, Anaheim, California, July 15, 1991., pp. 136-143." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S. \"Decoding the Stepwise Refinement Process: Stepwise Refinement as a Problem Solving Activity\". Third International Conference on Software Engineering and Knowledge Engineering, Skokie, Illinois, June 22-24, 1991, pp. 108-113." ], [ "Reynolds, R. G., \"Autonomous Learning Elements: Their Design and Application\", in IEEE Proceedings of Second Annual Conference on AI, Simulation and Planning in High Autonomy Systems, Cocoa Beach, Florida, April 1-2, 1991, pp. 6-14." ], [ "Reynolds, R. G., and Maletic, J. I., \"Software Reuse as a Problem in Machine Learning\". Proceedings of Fourth Florida Artificial Intelligence Research Symposium, Cocoa Beach, Florida, April 2-5, 1991, pp. 155-159." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"An Object-Oriented Approach to the Acquisition of Software Engineering Knowledge\", ACM National Conference, San Antonio, March 5-7, 1991, pp. 78-84." ], [ "Porvin S., and Reynolds, R. G., \"Divide and Conquer as a Paradigm for Program Implementation\", An Empirical Assessment, ACM National Conference, San Antonio, March 5-7, 1991, pp. 618-632." ], [ "Reynolds, R. G., \"The Control of Genetic Algorithms Using Version Spaces\", Proceedings of Second IEEE International Conference on Tools for AI, Washington D.C., Nov. 5-8, 1990, pp. 485-493." ], [ "Reynolds, R. G., \"Search Hypothesis Spaces Using Genetic Algorithms\", Selected Papers of 5th International Symposium on Methodologies for Intelligent Systems, Knoxville, Tennessee, October 24-27, 1990, pp. 191-202" ], [ "Reynolds, R. G. and Esteva, J. C., \"Recognition of Structurally Reusable Software Modules by Induction\", in Proceedings of the Second International Conference on Knowledge Engineering and Software, Skokie, IL, June 21-23, 1990, pp. 19-25." ], [ "Reynolds, R. G., and Esteva, J. C., \"Learning to Recognize Reusable Software by Induction in the PM System\", in Proceedings of 8th Annual SPIE Conference on the Applications of Artificial Intelligence, Orlando, Florida, April 17-19, 1990, pp. 664-670." ], [ "Reynolds, R. G., and Maletic, J. I., \"The Use of Refinement Metrics to Assess Programming Language Support for the Stepwise Refinement Process\", in Proceedings of 1990 ACM 18th Annual Computer Science Conference, Washington, D.C., Feb. 21-23, 1990, pp. 82-88." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"PM: A Metrics Driven Plan Compiler for Ada\", in Proceedings of Fifth Annual Conference on Artificial Intelligence and Ada, Nov. 16-17, 1989. Washington D.C., pp. 149-160." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"PM: A Metrics-Driven Plan Compiler\", in Proceedings of the First IEEE International Conference on Tools for Artificial Intelligence, October 23-25, 1989. Fairfax, Virginia, pp. 677-684." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S. \"PM: A Metrics-Driven Approach to the Automatic Acquisition of Software Engineering Knowledge\", Proceedings of the Workshop on Automating Software Design, IJCAI-89, Detroit, Michigan, August 21, 1989, pp. 223-232." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"A Metrics-Driven Approach to the Acquisition of Software Design Knowledge\", in Proceedings of the Workshop on Knowledge Acquisition, IJCAI-89, Detroit, Michigan, August 22, 1989, pp. 141-144." ], [ "Reynolds, R. G., \"The Metrics-Driven Generation of Program Refinement Plans for Code Modules\", Proceedings of 1st International Conference on Knowledge Engineering and Software Engineering, Skokie, Illinois, June 15- 16, 1989. pp. 25-30." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"PM: A Metrics-Based Plan Compiler\", Proceedings of AAAI Workshop on AI and Software Engineering, University of Exeter, UK., April 12-14, 1989, pp. 32-35." ], [ "Reynolds, R. G., \"A Metrics-Driven Approach to the Automatic Acquisition of Software Engineering Knowledge\", in Proceedings of 1988 AAAI Workshop on Automated Software Design, St. Paul, Minnesota, August 26, 1988, pp. 121- 123." ], [ "Reynolds, R. G., \"Automated Program Development using Metric Information\", IEEE Software Design Metrics Workshop, Melbourne, FL., March 14-16, 1988, pp. 22-27." ], [ "Reynolds, R. G., \"Metrics-driven Acquisition of Software Engineering Knowledge\", Proceedings of the 6th Symposium on Empirical Foundations of Information and Software Science., Atlanta, Georgia, Oct. 19-21, 1988, pp. 60- 72." ], [ "Reynolds, R. G., \"The Application of Classifier Systems to the Acquisition of Software Engineering Knowledge\", Proceedings of the 1st International Conference on Industrial and Engineering Applications of Artificial Intelligence and Expert Systems. University of Tennessee Space Institute, Tullahoma, Tennessee. June 1-3, 1988, pp. 201-211." ], [ "Reynolds, R. G., \"A Heuristic Basis for the Origins of Agriculture\", Proceedings of 1986 IFAC Workshop on the Modeling of Decision-Making Systems, Beijing, China, August, 1986, pp. 47-54." ], [ "Reynolds, R. G., \"A Metrics-Based System to Monitor the Stepwise Refinement of Program Modules\", Proceedings of the Fourth Conference on Intelligent Systems and Machines, Oakland University, April 29-30, 1986, pp. 148-160." ], [ "Reynolds, R. G. and Azar G., \"An Adaptive Interface for Intelligent Information Retrieval\", Proceedings of the Fourth Conferences on Intelligent Systems and Machines. Oakland University, Rochester, Michigan, April 29-30, 1986, pp. 101- 110." ], [ "Esteva, J., and Reynolds, R. G., \"A Real-Time Knowledge-Based Expert System for Diagnostic Problem Solving\", Proceedings of Third SPIE Conference on Applications of Artificial Intelligence, Orlando, Florida, April 1-3, 1986, pp. 224- 232." ], [ "Reynolds, R. G. and Roberts, D., \"PARTIAL: A Tool to Support the Metrics Driven Design of ADA Programs\", Proceeding 1986 ACM 14th Annual Computer Science Conference, Cincinnati, Ohio, February 4-6, 1986, pp. 213-220." ], [ "Reynolds, R. G., \"The Design of an Adaptive Expert Database Interface\", Proceedings of NATO Workshop on the Design of Relational Database Machine Architecture, Les Arcs , France, July 15-26, 1985, pp. 557-572." ], [ "Zeigler, B. P., and Reynolds, R. G., \"Towards a Theory of Adaptive Computer Architecture\", in Proceedings of IEEE 5th International Conference on Distributed Computing Systems, Denver, Colorado, May 13-17,1985, pp. 212-224." ], [ "Reynolds, R. G., \"The Use of Expert Systems in Archaeology\", in Proceedings of International Union of Pre- and Proto-Historical Sciences, Denver, Colorado, April 29 - May 1, 1985, pp. 55-66." ], [ "Reynolds, R. G. and Cichanowski G. \"Distributed Algorithms for On-Line Bin Packing\", Proceedings of 1984 Conference on Intelligent Systems and Machines, Oakland University, Rochester, Michigan, April 24, 1984, pp. 110-121." ], [ "Reynolds, R. G. and Cichanowski G., \"A Parallel Algorithm for On-Line Bin Packing\", Proceedings, SIAM 1983 Fall Meeting, Norfolk, Virginia, November 3 - 7, 1983, pp. 88-96." ], [ "Reynolds, R. G. and Zargham M. R., \"Fault Dominance in Reliability Petri Nets\", Proceedings of Second International Symposium on Applied Simulation and Modeling, San Francisco, May 16-18, 1983, pp. 142-151." ], [ "Reynolds, R. G. and Zargham M. R., \"Reliability Petri Nets: Models for Fault Detection in Systems Using Expert Information\", Proceedings of First Conference on Artificial Intelligence, Oakland University, April 26, 1983, pp. 477-492." ], [ "Reynolds, R. G., \"Metrics to Assess the Structural Complexity of Parallel Programs\", Symposium on Empirical Foundations of Software Science, Atlanta, Georgia, November 3-5, 1982, pp. 188-200." ], [ "Reynolds, R. G. and Chang T. L., \"The PAL System: A Parallel Algorithm Design System for VLSI Based Architectures\", Proceedings 10th International IMACS Conference, Montreal, Canada, August 8-13, 1982, pp. 314-319." ], [ "Reynolds, R. G., \"A Computer Simulation of the Development of Incipient Agriculture in the Valley of Oaxaca, Mexico\", in Proceedings 10th International Conference on Pre- and Proto-Historical Sciences, Mexico City, Mexico, October 19-24, 1981, pp. 202-216." ], [ "Reynolds, R. G., Fisher P. D., and Bridge C., \"Asynchronous Arithmetic Algorithms for Data-Driven Machines\", presented at the 5th Symposium on Computer Arithmetic, Ann Arbor, Michigan, April 16-21, 1981 pp. 88-95." ] ] }, "Title" : "Papers Published in Refereed Conference Proceedings" } ] }, "Title" : "Journal Articles Published" }, { "Contents" : { "Items" : [ [ "Reynolds, R.G., A Review of Evolutionary Computation: The Fossil Record , David Fogel, Editor, Biosystems , 2000." ], [ "Reynolds, R.G., \"A Review of Evolutionary Computation: Towards a New Philosophy of Machine Intelligence by David Fogel\", Biosystems , 1997, pp. 277- 279." ], [ "Reynolds, R. G., \"A Review of Sauer and Chandys Book, Computer Systems Performance Modeling\", IEEE-Computer , Vol. 15, May 1982, pp. 157-158." ], [ "Reynolds, R. G., \"A Review of Cliff and Ords, Spatial Auto correlation\", Geographical Analysis , Vol. VI, January 1974, pp. 100-104." ] ] }, "Title" : "Book Reviews Published" }, { "Contents" : { "Contents" : [ { "Contents" : { "Items" : [ [ "Reynolds, R.G., Kinnniard-Heether, L., Auctions as Knowledge Distribution Mechanisms in Cultural Algorithms, IEEE SwarmHuman Blended Intelligence Workshop, Cleveland, Ohio, October 21-23, 2016." ], [ "Reynolds, R.G., Waris, Faisal, Learning Gesture Languages with Cultural Algorithms, IEEE SwarmHuman Blended Intelligence Workshop, Cleveland, Ohio, September 28-29, 2015." ], [ "Reynolds, R.G., Deep Sub-Cultured Problem Solving in Algorithms, invited keynote address at NaBIO, December 4, Durham, South Africa, 2015," ], [ "Gawasmeh, Y., Reynolds, R.G., A Computational Basis for the Presence of Sub-Cultures in Cultural Algorithms, IEEE Symposium Series on Computational Intelligence, Orlando Florida, December 9-12, 2014." ], [ "Ali, M., Awad, N., Reynolds, R.G., Balancing Search Direction in Cultural Alorithm for Enhanced Global Optimization, IEEE Symposium Series on Computational Intelligence, Orlando Florida, December 9-12, 2014." ], [ "Che, C., Reynolds, R. G., Monitoring the Vital Signs of a Complex Social System, 2014 IEEE World Congress on Computational Intelligence, July 6-11, 2014, Beijing, China." ], [ "Judeh T., Jayyousi T., Acharya L., Reynolds, R. G., and Zhu , Dongxiao, GSCA: Reconstructing Biological Pathway Topologies Using a Cultural Algorithms Approach, 2014 IEEE World Congress on Computational Intelligence, July 6-11, 2014, Beijing, China." ], [ "Ali, M, Morghem, Abdulmalik, AlBadarneh J., Al-Gharaibeh, R., Suganthan, P., and Reynolds, R.G., Cultural Algorithms Applied to the Evolution of Robotic Soccer Team Tactics: A Novel Perspective, Proceedings of 2014 IEEE World Congress on Computational Intelligence, July 6-11, 2014, Beijing, China." ], [ "Judeh, T., Acharya, L., Reynolds, R.G., and Zhu, D, 2013. Gene Set Cultural Algorithms: A Cultural Algorithms Approach to reconstruct networks from Gene Sets. ACM Conference on Bioinformatics, Computational Biology, and Biomedicine, BCB 2013, New York, NY, USA, ACM." ], [ "OShea, J., Lemke, A., Reynolds, R.G., Sonnenberg, E., Meadows, G., Approaches to the Archaeology of Submerged Landscapes: Research on the Alpena-Amberley Ridge, Lake Huron, Curacao, Curacao, Mexico, November, 2013." ], [ "Shaker, N., Togelius, J., Yannakakis, G. N., Likith, Satish P. K., Ethiraj, V. S.,Johansson, S.J., Reynolds, R.G., Kinnaird-Heether, L., Schumann T., and Gallagher, M., The Turing Test Track of the 2012 Mario AI Championship: Entries and Evaluation, IEEE Computational Intelligence in Games, August 5-8, Niagara Falls, Canada, 2013." ], [ "Jayyousi, T., and Reynolds, R.G., Using Cultural Algorithms to Generate Models of Ancient Urban Centers: The Monte Alban Example, 2013 IEEE International Conference on Evolutionary Computation, Can-Cun, Mexico, June 17-20, 2013. Best Overall Paper Award." ], [ "Fogarty, J., Reynolds, R.G., OShea, J., Che, X. and Salaymeh, A., Serious Game Modeling of Caribou Behavior Across Lake Huron Using Cultural Algorithms and Influence Maps 2013 BMI the Second International Conference on Brain-Mind , Michigan State University, July 27-28, East Lansing, 2013." ], [ "Reynolds, R.G., Cultural Algorithms in Virtual Worlds, IEEE South Eastern Michigan Spring Meetings, Dearborn, Michigan, April, 2013." ], [ "Conner-Warren, R., Reynolds., Nursing Virtual World Game, Midwestern Nursing Society, March 7-11, 2013." ], [ "Jayyousi, T., and Reynolds, R. G., Bringing to Life an Ancient Urban Center at Monte Alban, Mexico: Modeling the Emergence of Ancient Urban Centers. International Conference on Brain Mind, Michigan State University, East Lansing, Michigan, July 14-15, 2012." ], [ "Reynolds, R.G., and Gawasmeh, Y., Evolving Heterogeneous Social Fabrics for The Solution of Real Valued Optimization Problems Using Cultural Algorithms, 2012 IEEE World Congress on Computational Intelligence, Brisbane, Australia, June 9-15, 2012." ], [ "Reynolds, R.G., The Land Bridge Virtual World, in 2013 University of Michigan Land Bridge Workshop, February 23, 2013." ], [ "Kinniard-Heether, and Reynolds, R.G., Turing Test Entry Presentation, at IEEE World Congress on Computational Intelligence, June 7-12, 2012." ], [ "Jayyousi, T., and Reynolds, R. G., Bringing to Life an Ancient Urban center at Monte Alban, Mexico: Modeling the Emergence of Ancient Urban Centers, in International Conference on Brain Mind, Michigan State University, East Lansing, Michigan, July 14-15, 2012." ], [ "Reynolds, R.G., and Gawasmeh, Y., Evolving Heterogeneous Social Fabrics for The Solution of Real Valued Optimization Problems Using Cultural Algorithms, 2012 IEEE World Congress on Computational Intelligence, Brisbane, Australia, June 9-15, 2012." ], [ "Ali M., Salhieh A., Reynolds, R. G., Socio-Cultural Evolution via Neighborhood Restructuring in Intricate Multi-Layered Networks, 2012 IEEE World Congress on Computational Intelligence, Brisbane, Australia, June 9-15, 2012." ], [ "Jayyousi, T., and Reynolds, R. G., Bringing to Life an Ancient Urban center at Monte Alban, Mexico: Exploiting the Synergy Between the Macro, Meso, and Micro Levels in a Complex System, First International Conference on Complexity and Human Experience: Modeling Complexity in the Humanities and Social Sciences, Complexity in the Humanities and Social Sciences, University of North Carolina-Charlotte, May 30 June 1, 2012." ], [ "Ali, M., and Reynolds, R. G., The Emergence of Social Complexity in Optimizing Mechanical Design Problems via Cultural Algorithms, Advance Topics in Artificial Intelligence, Singapore, November 14-16, 2011." ], [ "Ali, M., Salhieh, A., and Reynolds, R. G., The Emergence of Cultural Hierarchical Social Networks in Deceptive Environments, International Paris, France, November 14-16, 2011. Conference on Computers, Electrical, and Systems Science, and Engineering." ], [ "Vitale, K., Reynolds, R. G., OShea, J., and Meadows, G., Exploring Ancient Landscapes Under Lake Huron Using Cultural Algorithms, IEEE Complex Systems Conference, Chicago, IL, November 1-3, 2011." ], [ "Reynolds, R.G., and Liu D., Multi-Objective Cultural Algorithms, IEEE 2011 Congress on Evolutionary Computation, New Orleans, Louisiana, June 6-9, 2011." ], [ "Ali, M., Salhieh A., Snaineh R. A., and Reynolds, R.G., Boosting Cultural Algorithms with an Heterogeneous Layered Social Fabric Influence Function, IEEE 2011 Congress on Evolutionary Computation, New Orleans, Louisiana, June 6-9, 2011." ], [ "Reynolds, R. G., Gawasmeh, Y ., Evolving Heterogeneous Social Fabrics for the Solution of Real Valued Optimization Problems Using Cultural Algorithms, Eighth International Conference on Complex Systems, June 26- July 1, 2011." ], [ "Snaineh R., Younes A., Ali, M., Salhieh A., and Reynolds, R. G., I-Architect A Virtual Reality CAD System 3rd Annual Undergraduate Research Conference on Applied Computing College of Information Technology, Zayed University, Dubai, UAE, May 4-5, 2011." ], [ "Vitale, K., Reynolds, OShea, J., Che X., Learning Group Behavior in Games Using Cultural Algorithms: The Land Bridge Example, Third IEEE Spring Symposium on Computational Intelligence SSCI, Paris, France, April 11-15, 2011, IEEE Press, pp: 147-155, 2011." ], [ "Che X., Ali M., Reynolds, R. G. Weaving the Social Fabric: The Past, Present and Future of Optimization Problem Solving with Culture Algorithms, AAAI Fall 2010 Symposium, Arlington, VA, November 11-13, 2010." ], [ "Ali, M., Reynolds, R.G., and Ali, R., Enhancing Cultural Learning under Environmental Variability Using Layered Heterogeneous Sociometry-Based Networks, IEEEACM on Web Intelligence Intelligent Agent Technology, Toronto, CA, August 31-Sept. 3, 2010." ], [ "Reynolds, R.G., Che, X., and Ali, M., Weaving the Social Fabric: The Past, Present and Future of Optimization Problem Solving with Culture Algorithms, AAAI Fall Symposium on Complex Adaptive Systems, November 10-12, 2010." ], [ "Xiangdong Che, Ali M., Reynolds R. G., Robust Evolutionary Optimization at the Edge of Chaos: Commercialization of Cultural Algorithms, IEEE World Congress on Computational Intelligence, Barcelona, Spain, July 18 -23, 2010." ], [ "Best C., Che X., Robert G. Reynolds, and X. Liu, Multi-Objective Cultural Algorithms, IEEE World Congress on Computational Intelligence, Barcelona, Spain, July 18 -23, 2010." ], [ "Ali M., Reynolds R. G., \"An Intelligent Social Fabric Influence Component in Cultural Algorithms for Knowledge Learning in Dynamic Environments,\" Web Intelligence and Intelligent Agent Technology, IEEEWICACM International Conference on Web Intelligence and Intelligent Agent Technology, 2009." ], [ "Ali M., Khamayseh Y., Reynolds R. G., \"Cultural Swarms - Knowledge-driven Framework for Solving Nonlinearly Constrained Global Optimization Problems,\" International Joint Conference on Computational-Intelligence, ICEC 09, Madeira, Portugal 2009." ], [ "OShea, J., Meadows, G., Reynolds, R., and R. Eustice, Mapping Ancient Landscapes and Hunting Sites, Geological Society of America, Milwaukee, Wisconsin, 2009." ], [ "Loiacono, D, Togelius, J., Luca Lanzi, P., Kinnaird-Heether, L., Lucas, S., Simmerson, M., Perze, D. Reynolds, R. G., and Saez, Y., IEEE Symposium on Computational Intelligence in Games, Perth, Australia, December 15-18, 2008." ], [ "Reynolds, R. G., and Ali, M., Embedding a Social Fabric Component into a Cultural Algorithms Toolkit, Proceedings of the International Workshop on Advanced Computational IntelligenceIWACI2008,University of Macau, Taipa, Macao, June 7-8, 2008." ], [ "Reynolds, R.G., and Ali, M., The Social Fabric Approach as an Approach to Knowledge Integration in Cultural Algorithms, 2008 Proceedings of IEEE World Congress on Computational Intelligence, Hong Kong China, June 1-6, 2008." ], [ "Reynolds, R.G., and Ali, M., Cultural Algorithms: Knowledge-Driven Engineering Optimization via Weaving a Social Fabric as an Enhanced Influence Function, 2008 IEEE World Congress on Computational Intelligence, Hong Kong China, June 1-6, 2008 ." ], [ "Reynolds, R. G., Cultural Algorithms, invited tutorial, 2008, Swarm Intelligence Conference, Saint Louis Mo., September 29, 2008." ], [ "Reynolds, R.G., Organizational Modeling with Cultural Algorithms, Panel Session on Preparing Academics for a Business World, Congress on Evolutionary Computation, Singapore, September 25-29, 2007." ], [ "Reynolds, R.G., Cultural Algorithms, invited keynote talk, 2007 IEEE Congress on Evolutionary Computation, Singapore, September 25-29, 2007." ], [ "Reynolds, R.G., Cultural Algorithms System CAT: A Testbed, IEEE Spring Symposium, Honolulu, Hawaii, April 1-5, 2007." ], [ "Reynolds, R.G., The Role of Culture in the Emergence of Decision-Making Roles: An Example Using Cultural Algorithms, 2005 Complexity Conference, University of Illinois, Champaign-Urbana, May 16-19, 2005." ], [ "Reynolds, R.G., Peng, B., and Whallon, R., Emergent Social Structures in Cultural Algorithms, NAACSOS 2005, Notre Dame University, Indiana, June 26-28, 2005." ], [ "Reynolds, R.G., Kobti, Z., and Kohler, T., Learning in Dynamic Multi-layered Social Networks: A Mesa Verde Example, 8 th International Conference on Geocomputation 2005, July 31-August 3, Ann Arbor Michigan, 2005." ], [ "Reynolds, R.G., Scheer, H., and Whallon, R., Agent-Based Modeling of Early Hominid Decision-Making, 2005 Society of American Archaeology Annual Meeting, Salt Lake City, Utah, March 30-April 3." ], [ "Reynolds, R.G., The Village Project: Modeling the Ancient Anazazi Using Cultural Algorithms, Workshop on the Village Project, Anazazi Heritage Center, Cortez, CO, October 22, 2004." ], [ "Reynolds, R.G., Kobti Z., and Kohler, T., Modeling the Emergence of Social Complexity in Mesa Verde Using Cultural Algorithms, Santa Fe Institute Workshop on the Emergence of Social Complexity, Santa Fe , NM, October 24-27, 2004." ], [ "Reynolds, R. G., Kobti, Z. , and Kohler, T., Agent-Based Modeling of Cultural Change in Swarm Using Cultural Algorithms, in Proceedings of SWARMFEST 2004, University of Michigan, Ann Arbor, May 9-11, 2004." ], [ "Kobti, Z., and Reynolds, R.G., Learning in Dynamic Multi-Layered Social Networks in Proceedings of 2004 Annual Meeting of the Society for American Archaeology, Montreal, Canada, March 31- April 4, 2004." ], [ "Reynolds, R.G., and Scheer, H., and Whallon, R., Agent-based Modeling of Economic Sharing in Pre- or Proto-Cultural Foraging Groups in Proceedings of 2004 Annual Meeting of the Society for American Archaeology, Montreal, Canada, March 31- April 4, 2004. Lu, S., Liu, D., Fotouhi, F., Dong, M., Reynolds, R.G., Aristar, A., Ratliff, M., Geoff Nathan, Joseph Tan, and Ronald Powell, Language Engineering for the Semantic Web: a Digital Library for Endangered Languages, Information Research, 93, April, 2004. Stefan, J., Reynolds, R.G., Fotouhi, F., Aristar, A., Lu, S.,and Dong, M., \"Evolution Based Approaches to the Preservation of Endangered Natural Languages\", in Proc. of the IEEE International Congress on Evolutionary Computation CEC2003, pp. 1980-1987, Canberra, Australia, December, 2003. Grosky, W. I.,, Fotouhi, F., Aristar, A., Lu, S., Dong, M., and Reynolds, R.G., A Digital Library for Endangered Languages, the Nara Symposium for Digital Silk Roads DSR, Nara, Japan, December, 2003." ], [ "Ostrowski, D., and Reynolds, R.G., Using Cultural Algorithms to Evolve Strategies for Recessionary Markets, Society for Industrial and Applied Mathematics Conference on Agent based Modeling and Simulation, November 3-6, Minneapolis, Minnesota, 2003." ], [ "Reynolds, R.G., and Stefan, J., Evolution-Based Approaches to the Preservation Endangered Natural Languages, Workshop on Digital Libraries for Cultural Preservation, Wayne State University, Detroit, Michigan, October 27, 2003." ], [ "Reynolds, R. G., Peng, Bin, and Brewster, Jon, The Impact of Culture on Social Interaction and Problem Solving: Cultural Swarms, NAACSOS 2003, June 20-22, 2003, Pittsburgh, Pennsylvania." ], [ "Reynolds, R.G., Kobti Z., and Kohler, T., Agent-Based Approaches to Modeling the Ancient Anazazi Using Cultural Algorithms, NAACSOS 2003, June 20-22, 2003, Pittsburgh, Pennsylvania." ], [ "Lazar, A., and Reynolds, R. G., A Computational Framework for Modeling the Dynamic Evolution of Large-Scale Multi-Agent Organizations, Proceedings SPIE Conference on Enabling Technologies for Simulation Science, April 1-5, 2002." ], [ "Lazar, A., and Reynolds, R. G., Evolution-Based Learning of Ontological Knowledge for a Large-Scale Multi-Agent Simulation, Proceedings of 4 th International Workshop on Frontiers in Evolutionary Computation, Duke University, March 11-13, 2002." ], [ "Reynolds, R.G., Knowledge Swarms and Cultural Evolution, Proceedings of American Anthropological Association Annual Meeting, November 28-31, 2001, Washington, D.C." ], [ "Saleem, S., and Reynolds, R.G., Cultural and Social Evolution in Dynamic Environments, CASOS 2001, Carnegie-Mellon University, July 5-7, 2001." ], [ "Saleem, S., and Reynolds, R.G., Knowledge-Based Function Optimization in Dynamic Environments Using Cultural Algorithms, 2001 International Conference on Artificial Intelligence, Las Vegas, Nevada, June 25-28, 2001." ], [ "Saleem, S., and Reynolds, R.G., Workshop on Emergence, Transformation, and Decay in Socio-Natural Systems, Abisko, Sweden, May 19-23, 2001." ], [ "Reynolds, R.G., Learning in Large-Scale Multi-Agent Systems, Santa Fe Institute Workshop on Modeling Human Environmental Interaction, Santa Fe, New Mexico, December 7-9, 2000." ], [ "Reynolds, R.G., Approaches to Modeling Large-Scale Multi-Agent Systems using Cultural Algorithms, Workshop on Intelligent Multi-Agent Systems, University of Sienna, Sienna, Italy, September 4-6, 2000." ], [ "Reynolds, R. G., On the Evolution of Schemata for Function Optimization, Holland Fest 1999: New Directions in Evolutionary Computation Inspired by the Work of John Holland, Ann Arbor, Michigan, May 8-11, 1999" ], [ "Reynolds, R.G., and Chung, Chan-Jin, A Knowledge-Based Approach to Self-Adaptation in Evolutionary Search Using Cultural Algorithms, 12 th International FLAIRS Conference, Orlando, Florida, May 3-6, 1999." ], [ "Reynolds, R. G., The Impact of Raiding on Settlement Patterns in the Northern Valley of Oaxaca: An Approach Using Decision Trees, Santa Fe Institute Conference on Modeling the Dynamics of Agent Interaction in Small-Scale Societies, Sant Fe, New Mexico, September 14-17, 1998." ], [ "Reynolds, R. G., \"Intelligent Agent Modeling with Cultural Algorithms, presented at Sant Fe Institute Workshop on Intelligent Agent Modeling and the Simulation of Social Evolution, December 4-7, 1997." ], [ "Reynolds, R.G., \"Using Cultural Algorithms to Simulate Cultural Change in the Valley of Oaxaca, Mexico\", Special Session on Computational Models of Social Systems, American Association of Anthropology Annual Meeting, Washington, D. C., 1997." ], [ "Reynolds, R. G., \"Cultural Algorithms\", invited talk, UCLA Workshop on Computational Models of Social Systems: A Symposium in honor of Marvin Minsky, UCLA, February 29-March 2, 1997." ], [ "Reynolds, R.G., and Zannoni, E., \"Evolving Software Design Methodologies in Automatic Programming Systems Using Cultural Algorithms\", Second World Congress on Integrated Design and Process Technology\", Austin Texas, December 1-4, 1996." ], [ "Reynolds, R. G., and Chung, Chan-Jin, \"Function Optimization Using Evolutionary Programming with Self-Adaptive Cultural Algorithms, First Asian-Pacific Conference on Simulated Evolution and Learning, Taejon, Korea, November 8 -12, 1996." ], [ "Reynolds, R.G. and Chung Chan-Jin, \"The Use of Cultural Algorithms to Evolve Multiagent Cooperation\", 1996 World Cup Soccer Tournament, Taejon, Korea, November 8 -12, 1996 ." ], [ "Reynolds, R. G., and Chung, Chan Jin, \"The Use of Cultural Algorithms to Support Self-Adaptation in Evolutionary Programming\",1996 Adaptive Distributive Parallel Computing Symposium, Dayton, Ohio, August 8-9, 1996, pp. 260-271." ], [ "Reynolds, R.G., \"Modeling the Evolution of Social Complexity in the Valley of Oaxaca Using Cultural Algorithms\", Simulating Societies 1995, Boca Raton, Florida, Sept. 15-17, 1995." ], [ "Reynolds, R. G., Rolnick, S. R., \"Learning the Parameters to a Gradient-Based Approach to Image Segmentation Using Cultural Algorithms\", International Symposium on Intelligence in Neural and Biological Systems, May 29-31, 1995, Herndon, Virginia, pp. 240-247." ], [ "Reynolds, R.G., \"Solving Design Problems Using Cultural Algorithms\", Eighth Florida Artificial Intelligence Research Symposium, April 27-29, 1995, Melbourne, Florida, pp. 279-283." ], [ "Reynolds, R. G., and Maletic, J. I., \"An Adaptive Approach to Manufacturing Optimization Using Cultural Algorithms: A Float Glass Example\", Workshop on Artificial Intelligence in Automation, New Orleans, Louisiana, November 6, 1994." ], [ "Reynolds, R. G., and Sverdlik, W., \"Learning the Behavior of Boolean Circuits From Examples Using Cultural Algorithms\", Second Adaptive and Learning Systems Conference, SPIE International Symposium on Aerospace and Remote Sensing, Orlando, Florida, April 12-16, 1993." ], [ "Reynolds, R. G., and Ghezevat, H., \"The Inductive Learning of Software Metrics From Examples, Fifth Annual Oregon Workshop on Software Metrics, Silver Falls, Oregon, March 21-23, 1993." ], [ "Reynolds, R. G., Maletic J. I., and Zannoni, E., \"The Acquisition and Management of Reusable Software in the PM System\", First International Conference on Information and Knowledge Management, Baltimore, Maryland, November 8-10, 1992." ], [ "Reynolds, R. G., Maletic, J. I,, Zannoni, E., \"Operationalizing Software Reuse as a Problem in Machine Learning\", 5th International Conference on Industrial and Engineering Applications of Artificial Intelligence and Expert Systems, June 9-12,1992, Paderborn, Germany." ], [ "Reynolds, R. G., and Zannoni, E., \"Why Cultural Evolution Can Proceed Faster than Biological Evolution\", International Symposium on Simulating Societies, Surrey, England, April 2-3, 1992." ], [ "Reynolds, R. G., and Maletic, J. I., \"The PM System: An Approach to Operationalizing Software Reuse as a Problem in Machine Learning\", AAAI Workshop on Automating Software Design, Anaheim, California, July 15, 1991." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S. \"Decoding the Stepwise Refinement Process: Stepwise Refinement as a Problem Solving Activity\". Third International Conference on Software Engineering and Knowledge Engineering, Skokie, Illinois, June 22-24, 1991." ], [ "Reynolds, R. G., and Maletic, J. I., \"Software Reuse as a Problem in Machine Learning\". Fourth Florida Artificial Intelligence Research Symposium, Cocoa Beach, Florida, April 2-5, 1991." ], [ "Porvin S., and Reynolds, R. G., \"Divide and Conquer as a Paradigm for Program Implementation: An Empirical Assessment\", ACM National Conference, San Antonio, March 5-7, 1991." ], [ "Reynolds, R. G., \"Search Hypothesis Spaces Using Genetic Algorithms\", 5th International Symposium on Methodologies for Intelligent Systems, Knoxville, Tennessee, October 24-27, 1990." ], [ "Reynolds, R. G., and Esteva, J. C., \"Learning to Recognize Reusable Software by Induction in the PM System\", 8th Annual SPIE Conference on the Applications of Artificial Intelligence, Orlando, Florida, April 17-19, 1990." ], [ "Reynolds, R. G. and Maletic, J. I., \"The Use of Refinement Metrics to Assess Programming Language Support for the Stepwise Refinement Process\", ACM 18th Annual Computer Science Conference, Washington, D.C., Feb. 21-23, 1990." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"PM: A Metrics Driven Plan Compiler for ADA\", Fifth Annual Conference on Artificial Intelligence and ADA, Nov. 16-17, 1989. Washington, D. C." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"PM: A Metrics-Driven Plan Compiler\", First IEEE International Conference on Tools for Artificial Intelligence, October 23-25, 1989. Fairfax, Virginia." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S. \"PM: A Metrics-Driven Approach to the Automatic Acquisition of Software Engineering Knowledge\", Workshop on Automating Software Design, IJCAI-89, Detroit, Michigan, August 21, 1989, pp. 223-232." ], [ "Reynolds, R. G., Maletic, J. I., and Porvin, S., \"PM: A Metrics-Based Plan Compiler\", AAAI Workshop on AI and Software Engineering, University of Exeter, U.K., April 12-14, 1989." ], [ "Reynolds, R. G., \"A Metrics-Driven Approach to the Automatic Acquisition of Software Engineering Knowledge\", AAAI Workshop on Automated Software Design, St. Paul, Minnesota, August 26, 1988." ], [ "Reynolds, R. G., \"Automated Program Development using Metric Information\", IEEE Software Design Metrics Workshop, Melbourne, FL., March 14-16, 1988." ], [ "Reynolds, R. G., \"Metrics-driven Acquisition of Software Engineering Knowledge\", 6th Symposium on Empirical Foundations of Information and Software Science., Atlanta, Georgia, Oct. 19-21, 1988." ], [ "Reynolds, R. G., \"The Application of Classifier Systems to the Acquisition of Software Engineering Knowledge\", 1st International Conference on Industrial and Engineering Applications of Artificial Intelligence and Expert Systems, University of Tennessee Space Institute, Tullahoma, Tennessee. June 1-3, 1988." ], [ "Reynolds, R. G., \"Metrics-Based Reasoning about Pseudo-code Design in the Partial Metrics System\", ESDSMI Conference on Expert Systems, Dearborn, MI June 7-11, 1987." ], [ "Reynolds, R. G., \"A Heuristic Basis for the Origins of Agriculture\", IFAC Workshop on the Modeling of Decision-Making Systems, Beijing, China, August, 1986." ], [ "Reynolds, R. G., \"A Metrics-Based System to Monitor the Stepwise Refinement of Program Modules\", Fourth Conference on Intelligent Systems and Machines, Oakland University, April 29-30, 1986." ], [ "Reynolds, R. G. and Azar, G., \"An Adaptive Interface for Intelligent Information Retrieval\", Fourth Conference on Intelligent Systems and Machines. Oakland University, Rochester, Michigan, April 29-30, 1986." ], [ "Esteva, J. C., and Reynolds, R. G., \"A Real-Time Knowledge-Based Expert System for Diagnostic Problem Solving\", Third SPIE Conference on Applications of Artificial Intelligence, Orlando, Florida, April 1-3." ], [ "Reynolds, R. G. and Roberts, D., \"PARTIAL: A Tool to Support the Metrics Driven Design of Ada Programs\", ACM 14th Annual Computer Science Conference, Cincinnati, Ohio, February 4-6, 1986." ], [ "Reynolds, R. G., \"The Design of an Adaptive Expert Database Interface\", NATO Workshop on the Design of Relational Database Machine Architectures, Les Arcs , France, July 15-26, 1985." ], [ "Reynolds, R. G., \"The Use of Expert Systems in Archaeology\", International Union of Pre- and Proto-Historical Sciences, Denver, Colorado, April 29 - May 1, 1985, pp. 55-66." ], [ "Reynolds, R. G. and Cichanowski, G. \"Distributed Algorithms for On-Line Bin Packing\", Conference on Intelligent Systems and Machines, Oakland University, Rochester, Michigan, April 24, 1984." ], [ "Reynolds, R. G. and Cichanowski G., \"A Parallel Algorithm for On-Line Bin Packing\", SIAM 1983 Fall Meeting, Norfolk, Virginia, November 3 - 7, 1983." ], [ "Reynolds, R. G., \"Metrics to Assess the Structural Complexity of Parallel Programs\", Symposium on Empirical Foundations of Software Science, Atlanta, Georgia, November 3-5, 1982, pp. 188-200." ], [ "Reynolds, R. G. and Chang, T. L., \"The PAL System: A Parallel Algorithm Design System for VLSI Based Architectures\", Proceedings 10th International IMACS Conference, Montreal, Canada, August 8-13, 1982, pp. 314-319." ] ] }, "Title" : "Talks given by Dr. Reynolds for invited and/or Refereed Papers Internationally or Nationally abstract published" } ] }, "Title" : "Papers Presented" } ] }